[
  {
    "identifier": "oai:repository.uksw.edu:123456789/7302",
    "datestamp": "2016-06-09T00:19:06Z",
    "metadata": {
      "title": "The Role of L1 to Teach English for Primary School 5th Grade Students in Tarakanita Primary School Magelang",
      "creator": "Halim, Lukas Andree",
      "contributor": [
        "Nandari, Martha",
        "Kurniawati, Anita"
      ],
      "subject": [
        "teaching english",
        "grade 5 primary school",
        "and the role of L1"
      ],
      "description": "Pro and cons in using L1 in English language classroom has been discussed for many years. The pro sides argued that using L1 in FL classroom should be minimized for the learners in acquiring the target language. However, the cons sides revealed that using L1 in FL classroom had positive role in teaching-learning process, such as; to give instructions, to explain grammar concept or reading text, to explain the meaning of difficult vocabulary, to check the students' understanding, and to give feedback to the students which could help the learners in acquiring the L2. Inspired by the pros and cons, this study has attempted to investigate the role of L1 th teacher used when teaching grade 5 primary school students. This paper is based on the classroom  observations conducted in grade 5 English classes in Tarakanita Primary School, Magelang. It aimed  at showing the frequency of L1 usage in Teaching English to Primary School students. The findings suggested that L1 usage still took important roles in teaching learning process.",
      "date": [
        "2016-06-09T00:18:06Z",
        "2016-06-09T00:18:06Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112009090",
        "13080663",
        "http://repository.uksw.edu/handle/123456789/7302"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5178",
    "datestamp": "2015-06-23T02:05:35Z",
    "metadata": {
      "title": "Difficulties Faced by Mathematics and Science Teachers in Teaching Using English: A Study in SMAN 1 Salatiga",
      "creator": "Putra, Albertus Ronny Rizal Anggoro Octavin Asmara",
      "contributor": [
        "Timotius, Anne Indrayanti",
        "Suzana Maria L. A. F."
      ],
      "subject": [
        "bilingual",
        "RSBI"
      ],
      "description": "The  phenomenon that triggers  this study was the  fact  that  RSBI schools were going to be closed  in 2013.  There were some issues that could  be picked  up as the reasons, one of them was the teachers' problem in delivering materials in English  which was become one of aims  of this study.  To be exact, this  study aimed  to  investigate  the aids given by SMAN 1 Salatiga  in enhancing the English competency of the  Mathematics and Science  teachers  and understand the difficulties encountered by Mathematics and  Science  teachers of SMAN 1 Salatiga when they taught their subjects using English. The data were collected using an interview.  There were 8 teachers interviewed.  The results of this  study showed  that the schools gave aids, like facilitating bilingual books, establishing the sister school program, and giving English lessons;  which  were  hoped to  help the teachers in enhancing their English proficiency.  However,  the teachers were  still  having problems with  teaching using  English because of their competence,  especially compared to their students, their self confidence,  ageand the waste of time when they taught using English.",
      "date": [
        "2015-02-04T04:07:50Z",
        "2015-02-04T04:07:50Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112008022",
        "14040330",
        "http://repository.uksw.edu/handle/123456789/5178"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3381",
    "datestamp": "2014-01-24T07:52:49Z",
    "metadata": {
      "title": "The Perceptions of English Department Students on the Use of Multiple-choice Questions",
      "creator": "Tan, Merry",
      "contributor": [
        "Nandari S., Martha",
        "Christina Eko Setyarini, Maria"
      ],
      "subject": [
        "Students' Perceptions",
        "Multiple-Choice Questions"
      ],
      "description": "This study was aimed at investigating the English Department students' perceptions in Satya Wacana Christian University towards the use of multiple choice questions. The participant was composed of seventy-four students in Basic Grammar classes. The inventory of English Department students' perceptions was constructed to measure students' perceptions. The results revealed that students preferred multiple-choice questions more than other question types. They believed that multiple-choice questions are less difficult, less complex, clearer, more interesting, and fairer than other question types. They also believed that multiple-choice exam gives them a better chance to get a high score. In terms of psychology, the students felt more at ease or less anxious in doing multiplechoice exam compared to other question types. The overall findings showed that multiple-choice questions are more beneficial than harmful. As a conclusion, students' perceptions toward multiplechoice questions are not much different from the researchers' perceptions.",
      "date": [
        "2014-01-24T07:26:51Z",
        "2014-01-24T07:26:51Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112005156",
        "16060534",
        "http://repository.uksw.edu/handle/123456789/3381"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/1918",
    "datestamp": "2013-04-15T01:56:31Z",
    "metadata": {
      "title": "The Correlation Of Multiple Intelligences and English Score of 10th Grade Students at SMA Kristen Satya Wacana",
      "creator": "Galih Anindita, Yonathan",
      "contributor": [
        "Setiawan Husada, Hendro",
        "Astika, Gusti"
      ],
      "subject": [
        "Multiple intelligences",
        "English scores",
        "10th grade students"
      ],
      "description": [
        "Lembar Pengesahan tidak disertai tanda tangan dosen pembimbing",
        "This study reveals out certain correlation of eight types of multiple intelligences and English score of 101 people of 10th grade students at SMA Kristen Satya Wacana by using Multiple Intelligence Inventory Chislett version (2006) adapted from Gardner's Multiple Intelligence Inventory model (1983). The participants of this study were the number of students who attended\r\nand voluntary cooperated with the researcher on working in a classical administration of the research instrument through questionnaires which had been modified into recent research. Data statistic tool SPSS for Windows Version 16 was used to facilitate the data processing. The analysis of multiple intelligences that exists was based on Gardner's (1998) who proposed theory\r\nthat people have eight types of intelligences but in different level of strength, skill and limitation. ESL teachers can identify this through activities that they frequently have in their classes and categorized them to identify which one helps students in developing the types of intelligences. The findings of this study show that there was significant positive correlation between linguistic intelligence with English scores. An interesting finding shows that there was also negative correlation between bodily-kinesthetic intelligence and English scores. The following results were positive correlation but not significant between the English scores and logicalmathematical,\r\nspatial, musical, interpersonal, intrapersonal, and naturalistic intelligence. The study result is similar to Kim's (2009) research which revealed out that there is significant positive correlation between linguistic intelligence and the English score."
      ],
      "date": [
        "2013-04-15T01:54:45Z",
        "2013-04-15T01:54:45Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "12061002",
        "112006097",
        "http://repository.uksw.edu/handle/123456789/1918"
      ],
      "language": "en",
      "format": "application/pdf",
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/16585",
    "datestamp": "2022-03-02T04:23:09Z",
    "metadata": {
      "title": "Hell and Hope",
      "creator": "Hartono, Kezia Melva",
      "contributor": "Darta, Deta Maria Sri",
      "description": "Ana was a lonely girl who experienced bullying in school. Her life was completely changed after she was raped. She became more afraid of people and chose to isolate herself in one of orphanage rooms. One day she met a lawyer named Erin who wanted to help her at the court, but Ana refused it. After knowing the response, Erin replied it with harsh word that really hurt her. \r\n\tDuring her bad time, she also met her childhood friend, Yosi, that cared for her life, but, she response it at the same way. Her decision to do it alone made it worse than before, and the depression had come to be the major issue in her life. To release her anxiety, stressful life and hurt feeling, she did ‘self-injury’. So, how she coped with the problem when there was no positive change, and on the contrary, it became worse, worse and worse?",
      "date": [
        "2018-12-06T08:33:01Z",
        "2018-12-06T08:33:01Z",
        "2017"
      ],
      "type": "Thesis",
      "identifier": [
        "392013032",
        "18101010",
        "http://repository.uksw.edu/handle/123456789/16585"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Satra Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7272",
    "datestamp": "2016-06-07T04:18:18Z",
    "metadata": {
      "title": "Parents’ Roles Toward Their Bilingual Kindergarten Children’s Language Learning: a case study",
      "creator": "Indrawati, Dewi",
      "contributor": [
        "Husada, Hendro S.",
        "Widiningrum, Rindang"
      ],
      "subject": [
        "parents’ role",
        "Indonesian-English Bilingual Kindergarten",
        "english learning"
      ],
      "description": "This study examined parents’ involvements in their bilingual kindergarten children’s English learning at home. The participants of this study were two mothers and children of two families. The children were enrolled in a bilingual (English – Indonesian) kindergarten, and both mothers were multilingual speakers. A semi-structured interview and observations were conducted to collect the data. The mothers and children were interviewed separately, using different sets of questions but aimed for the same purpose. The results of this study indicated that in general both mothers played their roles as children’s first teacher, partner, motivator and facilitator, but in different frequency and consistency. However, the mother in the first family played her role as the first teacher and a motivator more actively than the mother in the second family did.",
      "date": [
        "2016-06-07T04:12:32Z",
        "2016-06-07T04:12:32Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008141",
        "13030472",
        "http://repository.uksw.edu/handle/123456789/7272"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/17856",
    "datestamp": "2022-03-16T01:33:12Z",
    "metadata": {
      "title": "Investigating the Influence of Teachers’ Beliefs in Choosing the Approaches of Grammar Teaching and Learning in EYL Classrooms",
      "creator": "Santosa, Katarina",
      "contributor": "Mambu, Joseph Ernest",
      "subject": [
        "grammar teaching approaches",
        "teachers’ beliefs"
      ],
      "description": "The issue of grammar teaching and learning approaches perspectives has been addressed in the literature, but how teachers’ beliefs influence their ways of choosing grammar teaching and learning approaches in EYL classroom has not been well documented. Therefore, this study aims to investigate how teachers’ beliefs influence their decisions to choose grammar teaching and learning approaches in EYL classrooms. An English teacher from a private Kindergarten school and 3 English teachers from a private Elementary school in Salatiga were observed and interviewed. Three classroom observations were conducted to explore the influence of teachers’ beliefs in choosing their ways to teach grammar. The results showed that all teachers considered grammar as an abstract part of language teaching and learning. They viewed both grammar teaching methods need to be aligned with the students’ condition and need of the class. Concerning the relation to class practice, the teachers believed that their teaching is also affected by their attitude towards grammar deliveries, which are associated with internal and external factors. During the learning process, the data showed a great deal of how teachers’ beliefs influence their ways of choosing grammar teaching and learning approaches in EYL classrooms.",
      "date": [
        "2019-09-11T03:08:28Z",
        "2019-09-11T03:08:28Z",
        "2018"
      ],
      "type": "Thesis",
      "identifier": [
        "112014022",
        "18100212",
        "http://repository.uksw.edu/handle/123456789/17856"
      ],
      "language": "id",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5378",
    "datestamp": "2015-03-10T02:38:29Z",
    "metadata": {}
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3490",
    "datestamp": "2014-02-03T06:44:01Z",
    "metadata": {
      "title": "A Study Of Students' Perspective Of Silence In The Classroom",
      "creator": "Anindyarizki Widhiprasetya, Gabriella",
      "contributor": [
        "Kurniawati, Anita",
        "Rani Setyo Sari, Sesilia"
      ],
      "subject": [
        "silent students",
        "teacher role",
        "class activity",
        "culture"
      ],
      "description": "This study discussed students' perspectives toward silence in the classroom. The aim of this study is to answer the research question, “What is ED students' view of silence in the classroom?” Six students of English Department of Satya Wacana Christian University were selected to be the participants of this study because of the limited of time. Four themed interview questions were asked to get ED students' general idea of silence in the classroom. The result of the study revealed that students do not always view silent students as ones who do nothing in class, but also it is how they learn a lesson. However, students also view silent as Indonesian culture that is already embedded in Indonesian students' mind. Pedagogical implication suggested by this study is that teachers will have to be more open minded about how they have to react regarding the students' behavior itself.",
      "date": [
        "2014-02-03T06:42:01Z",
        "2014-02-03T06:42:01Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008144",
        "16060469",
        "http://repository.uksw.edu/handle/123456789/3490"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9471",
    "datestamp": "2017-01-26T01:12:27Z",
    "metadata": {
      "title": "Students’ Attitudes Toward Teacher Feedback on Microteaching Class",
      "creator": "Sari, Firsta Puspita",
      "contributor": [
        "Kurniawati, Anita",
        "Widiningrum, Rindang"
      ],
      "subject": [
        "teacher feedback",
        "microteaching class"
      ],
      "description": "Teacher feedback has great influence on the students’ performance on Microteaching class. The teacher feedback helps the students in improving and showing the students’ progress for example, when the students did teaching and making lesson plan (Doughney, 2014). In this context, the teacher feedback has an important part in delivering improvement and progress of the students on Microteaching class. This study is aimed to find students’ attitude toward teacher feedback on Microteaching class since the class is regarded as a jumpingstone in order to face Teaching Practicum. This research used qualitative study since the writer used interview section in gathering data. From the data that the writer had gathered, there are some important findings which are teacher feedback is firstly, helpful for the students, the students need a further consultation in clarifying the teaching and lesson plan, the next one is the student reacts to the teacher feedback by gaining examples of lesson plan resources through internet, and the last one is oral teacher feedback is more preferred rather than the written one, however, most of the students respond the feedback only by improving their lesson plans.",
      "date": [
        "2017-01-26T01:11:47Z",
        "2017-01-26T01:11:47Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112012030",
        "16063224",
        "http://repository.uksw.edu/handle/123456789/9471"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/1601",
    "datestamp": "2013-03-26T01:39:36Z",
    "metadata": {
      "title": "The Analysis of African American Real Society During the Harlem Renaissance Era Reflected in the Story Red Headed Baby",
      "creator": "Novita",
      "contributor": [
        "Kusumaningtyas, Purwanti",
        "Maria L. A. F., Suzana"
      ],
      "subject": [
        "Harlem Renaissance",
        "African American",
        "Socio-Cultural",
        "Slavery",
        "Race Oriented",
        "Racial",
        "Mulatto"
      ],
      "description": [
        "Lembar Pengesahan tidak disertai tanda tangan dosen pembimbing",
        "Literary works relate widely with the background, as well as the life history of the author. When we read a literary work, more or less we read the mirror of the author's life. Here in the short story entitled Red Headed Baby written by Langston Hughes, I find the richness of these cultural aspects as well as the social perspectives. Besides being a black writer, Langton Hughes was also a main person in Harlem renaissance, which makes his literary work such as this novel Red Headed Baby worth discussing related to the socio cultural of the black society at that time being. In this story, the background which connects closely with slavery is a very interesting aspect to discuss. Viewed from the era when Langston was famous as a writer, this story took place exactly at the time when Harlem Renaissance was the society's trend. The trend of the time is to get rid of slavery. Here in my thesis I would like to discuss the issue occurred in the work in order to help us understand the similarity between the real life society on that era and the life told in the story. Therefore this discussion might help the readers to comprehend the situation in the past viewed from the literature works created at that era of the story. In the end, my reasearch following has explained the link between the society at that time, Langton Hughes as the writer of the Red Headed Baby, and the most important is to the story Red Headed Baby itself."
      ],
      "date": [
        "2013-03-26T01:38:20Z",
        "2013-03-26T01:38:20Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "12030591",
        "112005097",
        "http://repository.uksw.edu/handle/123456789/1601"
      ],
      "language": "en",
      "format": "application/pdf",
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7250",
    "datestamp": "2016-06-03T07:30:59Z",
    "metadata": {
      "title": "An Investigation of the Difficulties Encountered by Senior High School Debaters in Making Arguments",
      "creator": "Wibisono, Aditya Purnama Saputra",
      "contributor": [
        "Listyani",
        "Rudianto, Christian"
      ],
      "subject": [
        "arguments",
        "difficulty",
        "debate",
        "senior high school debaters"
      ],
      "description": "Many debating competitions are now held for senior high school students. Most of schools have debating organizations as means for students to learn English. One of the most fundamental problems for senior high school debater lies on their incapability to produce a good argument. The general purpose this study is to examine the difficulties in making arguments that senior high school debaters encountered. This study is a qualitative study. A total of six participants of senior high school debaters in Salatiga were asked to make a regular journal pertaining to difficulties they faced when they finished debating. Afterwards, those six students were interviewed to gain more details on their answer. The result showed that there were three main difficulties senior high school encountered, such as, difficulty in arguments preparation, difficulty in making claims, and difficulty in developing arguments.",
      "date": [
        "2016-06-03T07:30:25Z",
        "2016-06-03T07:30:25Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008042",
        "13030550",
        "http://repository.uksw.edu/handle/123456789/7250"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/10169",
    "datestamp": "2017-03-06T06:56:01Z",
    "metadata": {
      "title": "Reasons for Mixing English Words on Facebook Post",
      "creator": "Walangitan, Misael Aldo",
      "contributor": [
        "Sumakul, Dian Toar Y.G",
        "Rudianto, Christian"
      ],
      "subject": [
        "code mixing",
        "facebook",
        "CMC"
      ],
      "description": "In conversatin, billinguals may tend to do code mixing. The development of the internet offers a new medium for communication, know as Compoter Mediated Communication(CMC) where cod mixing continues to occur. The occurrence of code mixing is based onseveral reasons (Hoffman, 1991: Kow, 2003). This research was conducted to investigate the reasons people mix English words on Facebook. To fulfill the aim of this study, there were seven Indonesia English as a Foreign Language (EFL) learmers as Facebook users selected in this study. Two instruments were used to get the data, observatins and interviews. Observations were integrated to look for posts consisting if mixes of Indonesia and English words.From the observations, 3 posts from each participant were used as the data. After analyzed the posts, the participants were then interwiewed to investigate their reasons in mixing English words into their posts. The occurrences of mixing English words were analyzed using Kow's (2003) 10 conditions. The results showed that there were only 4 reasons identified under the 10 conditions and there were other outside the 10 conditions. These differeces might come from the fact that Kow's (2003) lassification were based on spoken interection, while this study was conducted under CMC environtment where spoken and written features are both incorporated in the interactions.",
      "date": [
        "2017-03-06T06:55:03Z",
        "2017-03-06T06:55:03Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112010103",
        "16020432",
        "http://repository.uksw.edu/handle/123456789/10169"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9416",
    "datestamp": "2017-01-25T02:42:23Z",
    "metadata": {
      "title": "Translation Strategies in the Rendetion of The Amazing Grace Song into Indonesian",
      "creator": "Sapoetra, Adrianus Gita Dora Khono",
      "contributor": [
        "Murtisari, Elisabet Titik",
        "Kendenan, Esriaty  S."
      ],
      "subject": [
        "translation",
        "strategies",
        "poetry",
        "song lyric"
      ],
      "description": "Translation is very popular nowadays especially in our country Indonesia. There are so many strategies in making a translation depending on the text that we are going to use. This research conducted to analyze the translation strategies that used in the rendition of the Amazing Grace song into Indonesian. Translating song lyric is not similar with translating another text. Actually song lyric is like a poetry so when making a translation of song lyric we have to choose the appropriate strategy. In analyzing Amazing Grace song the researcher will divide it into two aspects, the first is about meter and rhyme and the second is about transferring the meaning. From the analysis we will know that the meter and rhyme from the SL and TL is similar. Only a few of them that has different types of rhyme. For transferring the meaning between the SL and TL, interpretation is the strategy that the translator used when translating this song lyric.",
      "date": [
        "2017-01-25T02:41:40Z",
        "2017-01-25T02:41:40Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112011021",
        "16063276",
        "http://repository.uksw.edu/handle/123456789/9416"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3471",
    "datestamp": "2017-07-20T01:52:04Z",
    "metadata": {
      "title": "An Analysis of English Student-Teachers in Managing the Use of Bahasa Indonesia in Satya Wacana Christian Junior Lab School English Classroom",
      "creator": "Qusaroh, Ika Adelia",
      "contributor": [
        "Zacharias, Nugrahenny T.",
        "Kurniawati, Anita"
      ],
      "subject": [
        "Mother tongue (MT/L1/Bahasa Indonesia)",
        "Target language (TL/ English)",
        "student-teachers",
        "classroom interactions",
        "students (Ss)",
        "a student (S)"
      ],
      "description": "This paper addresses the important use of teacher‟ mother tongue (Bahasa Indonesia) in the English classroom. This finding aims to analyze the importance use of Bahasa Indonesia in the English class interactions. A total of ten English Department studentteachers who taught in Satya Wacana Junior Lab School Salatiga, Indonesia participated and were interviewed by using stimulated recall interview. Qualitative analysis is carried out to analyze the data. The findings demonstrate that student-teachers use Bahasa Indonesia in four domains: explaining English tenses, giving instruction, checking comprehension and classroom management. The results showed that the important use of Bahasa Indonesia are for giving clearer English explanation to the students, reinforcing the students‟ knowledge and to save time. As a result of this study may be useful for English teachers to be judicious teachers in using Bahasa Indonesia in English class classroom. This paper is also completed with the pedagogical implications at the end of the paper.",
      "date": [
        "2014-02-03T00:44:06Z",
        "2014-02-03T00:44:06Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008104",
        "13070821",
        "http://repository.uksw.edu/handle/123456789/3471"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5464",
    "datestamp": "2015-03-16T01:40:56Z",
    "metadata": {
      "title": "A Multiculturalism Perspective: Identity-Related Problems in a Plural Society As Experienced by the Protagonist of Lian Gouw's Only A Girl",
      "creator": "Lionardi, Gregorius Sebastian",
      "contributor": [
        "Toar, Dian",
        "Isharyanti, Neny"
      ],
      "subject": [
        "Vocabulary",
        "Vocabulary Knowledge Scale (VKS)",
        "Criminal Case",
        "learning",
        "game",
        "pre-test",
        "post-test"
      ],
      "description": "Technology has its roles in educational field such as it becomes the medium of teaching or learning.  Nowadays, the problem  that  arises  is  when teachers or learners want to determine  the effective way  of teaching or learning  vocabulary  using technology.  This study  is  aimed  at finding  out  whether the fruit of technology like games can be an effective way in learning vocabulary, especially in  learning  English vocabulary. As Prensky (2002) stated  that if someone plays  a game,  whether he/shewants it or not, learning happens constantly.  Previous study  from  Sorayaie  (2012) revealed that games contribute to vocabulary learning if students have  the  chance to learn, practice,  and review English language in a pleasant atmosphere.  Based on theprevious studies, this study was  conducted using Criminal Case game  in Facebook  as the medium and Vocabulary Knowledge Scale  from  Wesche and Paribakht (1996)  in pre-test and post-tests.  There were 30 (thirty) students who participated in this study. The pre-test was conducted one time, while the post-test was conducted two times(two days and two weeks after playing Criminal Case).  Descriptive statistics, especially Paired Sample T Test was used to analyze  and compare  the data.  The findings,  the result of pre-test and post-tests,  showed the significance of game in learning vocabulary and  some phenomenon related to the result of the study such as outlier or negative change.",
      "date": [
        "2015-03-16T01:37:07Z",
        "2015-03-16T01:37:07Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112010052",
        "14110822",
        "http://repository.uksw.edu/handle/123456789/5464"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9482",
    "datestamp": "2017-01-26T01:47:41Z",
    "metadata": {
      "title": "Student Teachers’ Perspectives Toward Teaching",
      "creator": "Prihastuti, Fajarini",
      "contributor": [
        "Kurniawati, Anita",
        "Palupi, Victoria Usadya"
      ],
      "subject": [
        "student teachers’ perception",
        "teaching journal",
        "reflective journal"
      ],
      "description": "This research aims to investigate the student teachers’ general perceptions of reflective journal. The participants of this research were 40 student teachers in English Language Education Program of Satya Wacana Christian University who taught in junior high schools. In this research, the data were collected using the questionnaire. The result revealed that the majority of participants considered reflective journal as a self-assessment tool which helps them improve their teaching performance. They also considered it as a motivation tool which enables them to share their feelings and problems they encountered during teaching session. Regarding the reflective journal’s contents, student teachers included some important contents which are describing, comparison and criticism stage. On the describing stage they shared their feelings and problems they encountered. On comparison stage they included their strength and weakness and mentor’s or friends’ feedback. On criticism stage they shared possible solution to the problems the encountered and the teaching strategies they used. There were only few of the student teachers who included the related theories on their reflective journal which was meant to help them monitor and generate their improvement in teaching process.",
      "date": [
        "2017-01-26T01:47:10Z",
        "2017-01-26T01:47:10Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112012041",
        "16062073",
        "http://repository.uksw.edu/handle/123456789/9482"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9431",
    "datestamp": "2017-01-25T04:22:33Z",
    "metadata": {
      "title": "EFL Learners’ Vocabulary Deficiencies During Computer-Mediated Communication",
      "creator": "Wijaya, Maria Laurensia Adeline Angelika",
      "contributor": [
        "Sumakul, Dian Toar Y.G.",
        "Timotius, Anne Indrayanti"
      ],
      "subject": [
        "vocabulary",
        "vocabulary deficiencies",
        "computer-mediated communication"
      ],
      "description": "Vocabulary knowledge is one of important aspects in language learning, especially for EFL learners who use English as their foreign language. Meanwhile, vocabulary deficiencies are one aspect that often occurs unconsciously to EFL learners. This study aims to identify which type of vocabulary deficiencies that mostly occur in Faculty of Language and Literature learners, SatyaWacana Christian University, Salatiga during online chatting in English. Using Computer-Mediated Communication (CMC), the participants did an online chatting and recorded. The data precede using Stimulated Recall Protocol (SRP) and a semi-structured interview. The data were analysed based on four vocabulary deficiencies classsification by Rahsidi and Koshravi (2010). One type of vocabulary deficiencies was found out to have the most occurrences and two deficiencies were found to be related to each other. The findings of this study might provide helpful guideline for EFL teacher and/or learners to anticipate and give a better understanding of vocabulary deficiencies.",
      "date": [
        "2017-01-25T04:21:59Z",
        "2017-01-25T04:21:59Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112011072",
        "16062085",
        "http://repository.uksw.edu/handle/123456789/9431"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/10592",
    "datestamp": "2017-03-30T02:14:47Z",
    "metadata": {
      "title": "An Analysis of Metaphor Translation Strategy in “The Fault In Our Stars” by John Green",
      "creator": "Octavia, Errisha Resty",
      "contributor": [
        "Setyarini, Maria Christina Eko",
        "Murtisari, Elisabet Titik"
      ],
      "subject": [
        "metaphor",
        "metaphor translation strategy",
        "The Fault in Our Stars"
      ],
      "description": "Metaphors which compare two unrelated things indirectly without using any expressions of comparison are often used in literary works such as novels, short stories, and poetry. Translating a metaphor is challenging as it cannot be translated literally if the message is to be fully  transferred. Hence, a deep understanding is needed in order to be able to understand the meaning of the metaphors. This study attempts to find out the strategies used in translating the metaphor in \"The Fault in Our Stars\" novel by John  Green. The data were collected by listing the metaphors from the source  text and the translated version. The data were analyzed by using metaphor translation strategies which are proposed by Newmark (1988) and Larson (1988). Out of seven the strategies, there are only three strategies used by the translator to translate the metaphors. The finding is expected to help the study of meaning related to metaphors, also it can be useful for the readers who intend to have a  research on metaphor translation.",
      "date": [
        "2017-03-30T02:14:19Z",
        "2017-03-30T02:14:19Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112011078",
        "16020484",
        "http://repository.uksw.edu/handle/123456789/10592"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3400",
    "datestamp": "2014-01-28T03:31:47Z",
    "metadata": {
      "title": "An Investigation Of Metacognitive Reading Strategies Of English Department Students At Satya Wacana Christian University",
      "creator": "Ayu Sari, Adhaka",
      "contributor": [
        "Astika, Gusti",
        "Manara, Christine"
      ],
      "subject": [
        "Metacognition",
        "Reading research",
        "Reading strategies"
      ],
      "description": "Many students find reading class the most difficult course in English. They dislike reading because they often do not understand the text. One of the many problems students face nowadays is not their inability to read but their lack of interest, indifference or rejection of reading. The general purpose of this study was to examine students reading strategies used when they read academic texts. This study used a descriptive method to gain broader perspectives on English Department learners‟ strategy use. A total of 50 students responded to a 30-item Awareness of Reading Strategies Inventory (MARSI). The results showed that as far as the three categories of strategies were concerned, students showed a moderate to high strategy use, with problem-solving strategies (Mean = 3.53) as their prime choice, followed by global strategies (Mean = 3.18) and support strategies (Mean = 2.61).",
      "date": [
        "2014-01-28T03:10:23Z",
        "2014-01-28T03:10:23Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112007183",
        "13050388",
        "http://repository.uksw.edu/handle/123456789/3400"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3401",
    "datestamp": "2014-01-28T03:17:21Z",
    "metadata": {
      "title": "Vocabulary Learning By English Department Students At Satya Wacana Christian University",
      "creator": "Purnamasari, Yesy",
      "contributor": [
        "Astika, Gusti",
        "Setiawan Husada, Hendro"
      ],
      "subject": [
        "Vocabulary",
        "learning",
        "strategies",
        "vocabulary research"
      ],
      "description": "Vocabulary learning is one of the most important challenges that learners will face throughout language learning process. Vocabulary has been considered as important to language use in which lack of vocabulary knowledge of learners can lead to difficulties in learning. Furthermore, utilization of vocabulary learning strategies also affects students' performance. So it was important to investigate the utilization of vocabulary learning strategies by learners. The general purpose of this study was to describe strategies used by students in learning vocabulary. Based on the purpose of this study, the method for this research was descriptive. A total of 50 English department students from different academic years responded to a 33-item vocabulary learning strategies questionnaire which was designed based on theory proposed by Stoffer (1995), Schmitt (2000), Grabe (2009). Finally the results showed the most frequently used strategies, such as learning for meaning, having the need to acquire new vocabulary, finding opportunities to use and practice the new words, memorizing the meaning of the words when there was a test, and uttering that the teacher helped them individually to comprehend new vocabulary.",
      "date": [
        "2014-01-28T03:16:12Z",
        "2014-01-28T03:16:12Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112007197",
        "13030303",
        "http://repository.uksw.edu/handle/123456789/3401"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5432",
    "datestamp": "2015-03-12T08:12:20Z",
    "metadata": {
      "title": "The Correlation Between Students' Motivation and Their Scores in Integrated Course",
      "creator": "Terviana, Agnes Yulia",
      "contributor": [
        "Astika, I Gusti",
        "Isharyanti, Neny"
      ],
      "subject": [
        "motivation",
        "achievement",
        "Integrated Course"
      ],
      "description": "One of the courses offered to English Department students in the first year is Integrated Course, which  integrates  the four language skills;  reading, writing, listening and speaking and also other language components such as grammar and vocabulary. One problem faced by students in this course is motivation. This study aims to describe how motivation correlates with students' achievement, since motivation is always consideredas an influential factor toward students' achievement in successful language learning. This research was conducted on 98 English Teacher Education students in Satya Wacana Christian University, Salatiga, Indonesia.  There were questionnaires with 15 items provided to find out the students' motivation. In order to describe the correlation between the data sets, the motivation scores were calculated together with Integrated Course final scores using Spearman Rank-Order Correlation Coefficient. The result shows that achievement in  Integrated Course  is not always affected by students' motivation itself. A highly-motivated student did not always have greater achievement compared to a student with low motivation.",
      "date": [
        "2015-03-12T08:08:50Z",
        "2015-03-12T08:08:50Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112010011",
        "14110724",
        "http://repository.uksw.edu/handle/123456789/5432"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/1931",
    "datestamp": "2013-04-15T06:25:40Z",
    "metadata": {
      "title": "The Motive of the Antagonist's Behavioral Changes in Kate Chopin's “Desiree's Baby”: a Psychoanalysis Perspective",
      "creator": "Mulyani, Eni",
      "contributor": [
        "Kristono, Lany",
        "Sriastuti, Anna"
      ],
      "subject": [
        "behavioral changes",
        "the unconscious",
        "the id",
        "the superego",
        "the ego",
        "repression",
        "motivation",
        "defense mechanisms"
      ],
      "description": [
        "Lembar Pengesahan tidak disertai tanda tangan dosen pembimbing",
        "One thing that anybody cannot avoid is problem(s). Problems may change one's attitude or behavior. The change becomes another problem if it makes other people around that particular person uncomfortable. Since literary works depict human life, including its problems and the behavioral changes of the characters, this study aimed to investigate the hidden causes of the antagonist's behavioral changes in “Desiree's Baby” using psychoanalytic criticism as the framework. Freud's psychoanalysis theory is the most appropriate theory to understand behavior patterns for it focuses on conscious and unconscious influences in one's behavior. The analysis results in a finding that the antagonist's motivation and behavior patterns are governed by his repressed feelings of disappointment about his true identity in the unconscious mind. Examining a character in a story using psychoanalysis view can also help us to understand life, behavior, and people around us better. Hence, the findings of this study improve our understanding of\r\nhuman behavior."
      ],
      "date": [
        "2013-04-15T06:24:43Z",
        "2013-04-15T06:24:43Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "12030222",
        "112007118",
        "http://repository.uksw.edu/handle/123456789/1931"
      ],
      "language": "en",
      "format": "application/pdf",
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3475",
    "datestamp": "2014-02-03T01:34:59Z",
    "metadata": {
      "title": "Ideology And Hegemony In 'Ma Yan' And 'Orang Miskin Dilarang Sekolah'",
      "creator": "Ayunidya Suci, Rieka",
      "contributor": [
        "Kristono, Lany",
        "Maria L.A.F., Suzana"
      ],
      "subject": [
        "ideology",
        "hegemony",
        "education"
      ],
      "description": "Education is considered an important element that determines one's social status, although there are uneducated people who are successful. Such an idea about the importance of education is also reflected in Ma Yan and Orang Miskin Dilarang Sekolah. This is interesting because the main characters were still in elementary school. They even believed that education was the only way to help them get out of the trap of poverty. Therefore this study tried to find out what ideologies and hegemony were behind the characters' attitude toward education in both novels. The analysis revealed that their strong belief about education was rooted in culture, religious belief, parents' belief about education as reflected in family upbringing as well as their dream to get out of the trap of poverty. The findings are expected to make the readers understand why people may think that education is important and how ideologies are calculated.",
      "date": [
        "2014-02-03T01:15:58Z",
        "2014-02-03T01:15:58Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008116",
        "13070776",
        "http://repository.uksw.edu/handle/123456789/3475"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/10594",
    "datestamp": "2017-03-30T02:20:18Z",
    "metadata": {
      "title": "The Life of Gandhari from Mahabharata of Vyasa in Socialist Feminist Perspectives",
      "creator": "Mukti, Tria Citra Listiani",
      "contributor": "Kusumaningtyas, Purwanti",
      "subject": [
        "patriarchal culture",
        "mahabharata",
        "socialist feminist"
      ],
      "description": "Motivation is considered as one widely known study of subsequent relation with language performance. Following by an issue which has been investigated regarding its correlation links with motivation is gender. The present study examines motivational patterns and correlation across gender in English Foreign language learning. Participants  in the study are Satya Wacana Christian University advanced English major  undergraduate students. A questionnaire used for data collection  and statistical means of frequencies and correlation analysis employed for data analysis. The findings indicated that there was no significant difference between male and female participants. The significance of this studyis to reveal that it is important for teacher practice’ in English major undergraduate program with the reasons that they can indicate the extent to which motivation to learn is mediated by gender and that there would not be any bias on gender bases in their motivational patterns in learning English as a foreign language.",
      "date": [
        "2017-03-30T02:19:53Z",
        "2017-03-30T02:19:53Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112011081",
        "16020486",
        "http://repository.uksw.edu/handle/123456789/10594"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3492",
    "datestamp": "2014-02-03T07:10:31Z",
    "metadata": {
      "title": "Pre-Service Teachers' Experience In Using Game At SWCU High School Salatiga",
      "creator": "Windianto, Andika",
      "contributor": [
        "Usadya Palupi, Victoria",
        "Listyani"
      ],
      "subject": [
        "Pre-service teachers",
        "Teaching Practicum",
        "Game."
      ],
      "description": "As the use of games in class activity nowadays has become common, some teachers tend to use this kind of activity to attract student‟s attention. Sigurdardorttir (2010) also suggests that games can be a good teaching method when teaching foreign languages. This research focused on games that are used by pre-service teachers who conducted their practicum in SWCU (Satya Wacana Christian University) High School in Salatiga. However, since they are still learning to teach, this study will show how pre-service teachers deal with games as class activity. The aim of this research is to analyze pre-service teachers‟ experience in using games. Semi-structured interview were conducted after they finished their teaching practicum to collect the data from 10 participants who did their teaching practicum in SWCU High School. Observations were also conducted before the interview to check that pre-service teachers used games in their class activity, and to observe how they conducted their game. Games play an important role in the Teaching Practicum and that all of participants using game in their class it may need for additional knowledge about the games on their micro teaching class, so that they can know the various types of games and can use it appropriately, besides, with that knowledge, they can avoid problems that they face when implementing games in the future.",
      "date": [
        "2014-02-03T06:57:05Z",
        "2014-02-03T06:57:05Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008146",
        "13070780",
        "http://repository.uksw.edu/handle/123456789/3492"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3393",
    "datestamp": "2022-02-11T02:32:51Z",
    "metadata": {
      "title": "The Correlation Between Emotional Intelligence and Students' Achievement in SMA Negeri 3 Salatiga",
      "creator": "Guna, Nanda Adi",
      "contributor": [
        "Astika, Gusti",
        "Husada, Hendro Setiawan"
      ],
      "subject": [
        "emotional intelligence",
        "students’ achievement",
        "SMA Negeri 3 Salatiga"
      ],
      "description": "This study investigated the correlation between emotional intelligence and students' achievement in SMA Negeri 3 Salatiga. It used Spearman Rank Nonparametric Correlation Test to check the correlation. The data for the study were collected from the questionnaire and grades taken from the students' grade book reports. The analysis shows that there was no correlation between emotional intelligence and students' achievement.",
      "date": [
        "2014-01-28T01:26:07Z",
        "2014-01-28T01:26:07Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112007022",
        "13030344",
        "http://repository.uksw.edu/handle/123456789/3393"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5491",
    "datestamp": "2015-03-17T06:34:05Z",
    "metadata": {
      "title": "Students' Attitude Toward English Lesson in Vocational High School Salatiga",
      "creator": "Setiyawati, Handini",
      "contributor": [
        "Palupi, Victoria Usadya",
        "Rudianto, Christian"
      ],
      "subject": [
        "attitude",
        "EFL learner",
        "English learning"
      ],
      "description": "This paper studies the attitudes of  Vocational  High School  2 Salatiga  students towards English lesson  in term of their emotional, cognitive and behavioral aspects. English is one of the required courses, but it is not the main course in that school  because  the students mainly learn about a particular major they took in school. In this study  the researcher also examined  the role of method and material that  were  used in class. A total number  88  participants were chosen from three different classes. They were asked to answers the questionnaire and 22 students were choosen to be interviewed in order to get richer data.  The study showed that most students have a positive attitude towards English lesson and that they  have passion  to improve their English.  The finding also explored about the students' obstacles and their suggestion toward English lesson in order to  improve  the quality of the English learning process.",
      "date": [
        "2015-03-17T06:33:11Z",
        "2015-03-17T06:33:11Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112010125",
        "14110748",
        "http://repository.uksw.edu/handle/123456789/5491"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7317",
    "datestamp": "2016-06-09T03:02:09Z",
    "metadata": {
      "title": "Teachers' Beliefs on Teaching English in Elementary School",
      "creator": "Sugiyanto, Melawati",
      "contributor": [
        "Astika, Gusti",
        "Pattiwael, Athriyana S."
      ],
      "subject": [
        "elementary school",
        "teachers' beliefs",
        "english teaching and learning",
        "young learners"
      ],
      "description": "The purpose of this study is to analyze the teachers beliefs' on teaching English in elementary school. The research participants were 10 elementary school English teachers in Salatiga. The data were collected using a semi-structured interview which allowed the participants to share their thought and experiences in English teaching and learning for young learners. The results of this study reveals that the teachers believed English is important nowadays. They did not agree about an issue of ommitting English in elementary school. Thus, they believed that English should be learned as soon as possible. The teachers believed that they should consider the characteristics of young learners in teaching learning English and their psychological factors. Thus, most teachers believed that teaching and learning of English should be fun. They used some techniques to make the teaching learning fun, for example by using pictures, videos, songs, etc. They also used teaching procedures in their teaching.",
      "date": [
        "2016-06-09T03:00:56Z",
        "2016-06-09T03:00:56Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112009136",
        "13070791",
        "http://repository.uksw.edu/handle/123456789/7317"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9965",
    "datestamp": "2017-02-22T06:29:53Z",
    "metadata": {
      "title": "Vocabulary Teaching Strategies Used By Junior High School English Teachers",
      "creator": "Sari, Maria Kristiana",
      "contributor": [
        "Sumakul, Dian Toar Y. G.",
        "Widiningrum, Rindang"
      ],
      "subject": [
        "vocabulary teaching",
        "deliberate teaching",
        "strategies in presenting vocabulary"
      ],
      "description": "Vocabulary is one of important aspects of English that must be learned by English as Foreign Languge (EFL) learners. In junior high school level, learners often have difficulties in understanding text genres. This difficulties are experienced when learners encounter English phrases and words they never met before. Therefore, to help students with these difficulties in their learning, teachers have to present the vocabulary learning by using vocabulary teaching strategies in order to help the students understand and learn about the English words or phrases. The use of strategies in vocabulary teaching are the application of deliberate teaching that has similar purpose with planned vocabulary teaching, as the way for developing the learners’ word knowledge. This study was conducted to investigate the strategies used by English teachers when presenting vocabulary learning to their students in the classrooms. The subjects of this study were two English teachers at Satya Wacana Laboratory Junior High School in Salatiga. Six classroom observations were conducted during the English lessons; three observations for each teacher. To obtain more data, both teachers were also interviewed for about 10-15 minutes. The data from the interview was used to support the analyzes of the data taken from the observations. The result of this study revealed that there were only three vocabulary teaching strategies that were used by the two English teachers in their English lessons. Those strategies were translation, defining the meaning strategy, and oral drill.",
      "date": [
        "2017-02-22T06:28:20Z",
        "2017-02-22T06:28:20Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112010024",
        "16020418",
        "http://repository.uksw.edu/handle/123456789/9965"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/10125",
    "datestamp": "2017-03-03T06:57:39Z",
    "metadata": {
      "title": "Kinds of Teachers’ Instructional Models In A Bilingual Kindergarten",
      "creator": "Kristanti, Premi Citra",
      "contributor": [
        "Setyarini, Maria Christina Eko",
        "Timitius, Anne Indrayanti"
      ],
      "subject": [
        "EMI",
        "bilingual kindergarten",
        "teacher’s instructional models"
      ],
      "description": "The used of EMI (English as Medium Instruction) is no longer a new phenomenon in Indonesia. Nonetheless, the used of EMI in teaching might bring difficulty for the students in their learning, in particular for teaching young learners. Hence, teacher has to apply their teaching with instructional models that can help young learners understand the material. In this study, one class of a bilingual kindergarten, Satya Wacana Children Center, was observed. Two teachers of the class were interviewed. This study found that three types out of five instructional models suggested by Petrina (2007) were used in the teaching activities. The instructional models are Direct Instruction, Interactive Instruction, and Experimental Instruction. Teachers’ reasons of using the instructional models were also included. This study will hopefully be useful for any teacher in bilingual schools to make their instruction understandable for the students.",
      "date": [
        "2017-03-03T06:57:08Z",
        "2017-03-03T06:57:08Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112008129",
        "16020399",
        "http://repository.uksw.edu/handle/123456789/10125"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5480",
    "datestamp": "2015-03-17T02:51:38Z",
    "metadata": {
      "title": "A Needs Analysis on Grammatical Aspects in Textbooks For Students of Performing Arts at Satya Wacana Christian University",
      "creator": "Larasati, Maria Lusia Anindya",
      "contributor": [
        "Astika, I Gusti",
        "Toar, Dian"
      ],
      "subject": [
        "needs",
        "needs analysis",
        "ESP",
        "grammar items"
      ],
      "description": "This study was conducted to identify needs analysis on grammatical aspects in textbook for students of performing arts in Satya Wacana Christian University. In this study the textbook sample was taken from the Church Music Literature class. There was only one tool used in the study, Lesson Writer. The data of this study were collected by inputting the sample text to the tool mentioned. From the result of  Lesson Writerthere were 39 grammar items identified in the textbook. After being categorized, the result of this analysis indicated that Tenses and Word Class were the items appeared the most in the textbook. They became the need of the students at Faculty of Performing Arts as they need to understand the course books. Based on the result, there was a suggestion to put Tenses and Word Class in their English course syllabus.",
      "date": [
        "2015-03-17T02:50:55Z",
        "2015-03-17T02:50:55Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112010087",
        "14110844",
        "http://repository.uksw.edu/handle/123456789/5480"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7267",
    "datestamp": "2016-06-07T03:48:31Z",
    "metadata": {
      "title": "The Analysis To What Extent The Eil Material in An Eil Micro Teaching Class Reflects An Eil Approach",
      "creator": "Praptiningrum, Dhenok",
      "contributor": [
        "Zacharias, Nugrahenny T.",
        "Palupi, Victoria Usadya"
      ],
      "subject": [
        "EIL material",
        "EIL approach"
      ],
      "description": "The study aims to analyze to what extent the English as an international language (EIL) teaching material reflects an EIL approach. The reflection of EIL approach in this study is developed based on Matsuda’s (2011) EIL approach in her principles for EIL materials development. Inspired by Matsuda this study is attempted to analyze to what extent the EIL material reflects an EIL approach. This study is conducted in an EIL micro teaching class, a teaching practicum preparation which focuses on EIL teaching and learning in English Department of Satya Wacana Christian University, Salatiga. Based on the EIL teaching material designed for the EIL micro teaching class, this study analyzed the extent of the EIL approach reflected in an EIL material. The findings suggested that an EIL approach which is reflected in the EIL teaching material covers the example of English varieties today, the example of the use of English in L2 – L2 speakers (L2 – L2) communication, and the respect to the learners’ local culture.",
      "date": [
        "2016-06-07T03:47:59Z",
        "2016-06-07T03:47:59Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008111",
        "13030468",
        "http://repository.uksw.edu/handle/123456789/7267"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/10593",
    "datestamp": "2017-03-30T02:17:41Z",
    "metadata": {
      "title": "Students' Learning Motivation in English for Academic Purposes (EAP) Class",
      "creator": "Berninda, Clarissa Tiara",
      "contributor": [
        "Isharyanti, Neny",
        "Nandari, Martha"
      ],
      "subject": [
        "learning motivation",
        "english for academic purposes",
        "self-determination theory framework"
      ],
      "description": "This study aimed to explore students' learning motivation in English for Academic Purposes (EAP) class conducted at the Faculty of Health and Sciences of Satya Wacana Christian University, Salatiga, Indonesia. EAP emerged along with the increasing needs to learn English for various academic context using relevant materials. The issue of motivation was viewed as a separate issue which may contribute a lot to students' learning success, in addition to relevant materials. Self-Determination Theory was  used to find out the level of motivation. Close-ended questionnaires and interviewers were used to collect the data. Generally, the participants were scored as high motivated, although specifically English learning was based on some types of pressure which the participants incorporate to themselves. the use of materials adjusted with specific field of study could increase the participants' moyivation. The finding may provideinsight for teachers and other practitioners to develop a better course design and materials.",
      "date": [
        "2017-03-30T02:17:11Z",
        "2017-03-30T02:17:11Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112011079",
        "16020485",
        "http://repository.uksw.edu/handle/123456789/10593"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3468",
    "datestamp": "2014-01-30T08:30:34Z",
    "metadata": {
      "title": "An Analysis On The Translation Of The Collocations In Negeri 5 Menara",
      "creator": "Eka Larasati, Dewanti",
      "contributor": [
        "Christina Eko Setyarini, Maria",
        "Kristono, Lany"
      ],
      "subject": [
        "Translation",
        "collocations",
        "translational equivalence"
      ],
      "description": "Collocations need to be learned and mastered well, because they are used in everyday life. However, to learn about collocations is difficult for learners; even more in translating collocations is more difficult. This study discusses the way Indonesian collocations in Negeri 5 Menara translated into the English version The Land of Five Towers. This is a documentary analysis which means focusing on the analysis of the novel (Payne and Payne, 2004). The study is qualitative research because it tries to describe how Indonesian collocations are translated into English. The data were selected from the four chapters of the novel. The study reveals that the translator mostly translated the Indonesian collocations to English using indirect translational equivalence. The study also shows that there are similar pattern on the Indonesian collocations which are translated into English. In addition, there are two untranslated collocations and almost all the Indonesian collocations are not translated in the form of the complete English collocation in this study.",
      "date": [
        "2014-01-30T08:28:04Z",
        "2014-01-30T08:28:04Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008097",
        "16060535",
        "http://repository.uksw.edu/handle/123456789/3468"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/10161",
    "datestamp": "2017-03-06T06:37:17Z",
    "metadata": {
      "title": "Improving English Vocabulary Through Pearl’s Peril Game",
      "creator": "Rochmanawati, Desy",
      "contributor": [
        "Isharyanti, Neny",
        "Setyarani, Maria Christina"
      ],
      "subject": [
        "vocabulary",
        "pearl’s peril",
        "vocabulary learning",
        "game",
        "pre-test",
        "post-test"
      ],
      "description": "The increasing use of technology as the medium  of teaching and learning provides a great opportunity to adapt games especially computer games for educational purposes. Nowadays,  educators are trying to find the effective way of teaching vocabulary using technology. It is because the students often get bored with the vocabulary learning process. This study is aimed to know whether the use of computer online game is useful for learning English vocabulary.  This study was conducted by using Pearl’s Peril game in Facebook as the medium and Vocabulary Knowledge Scale from Wesche and Paribakht (1996) in the pre-test and the posttests. There were 30 (thirty) students Grade 2 from SMP Negeri 1 Banyubiru, Indonesia who participated in this study. The pre-test was conducted twice with different words, while the post-tests were conducted four times (two days and two and a half weeks after playing Pearl’s Peril game)  with different words as well. This study used Wilcoxon T-test in order to analyze and compare the data. The findings, the result  of pre-test and post-tests, showed the significance  of game in learning vocabulary  and some phenomenon related to the result of the study such as negative change. This study is hopefully providing benefit in teaching and learning vocabulary for both teachers and students.",
      "date": [
        "2017-03-06T06:34:56Z",
        "2017-03-06T06:34:56Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112010081",
        "16020428",
        "http://repository.uksw.edu/handle/123456789/10161"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9854",
    "datestamp": "2017-02-14T01:51:22Z",
    "metadata": {
      "title": "Feminist Analysis of Woman’s Situation in Test Pack Novel",
      "creator": "Arundyna, Kartika",
      "contributor": [
        "Kusumaningtyas, Purwanti",
        "Darta, Deta Maria Sri"
      ],
      "subject": [
        "feminism",
        "patriarchy",
        "married woman",
        "second sex",
        "test pack"
      ],
      "description": "Due to the fact that novel nowadays become one of popular product, so this study was conducted in order to analyze woman situation in Test Pack novel, one  of the famous creations of Ninit Yunita which first publishes at 2005, become best seller and made into a movie at 2012. Test Pack is a novel which raises a theme about marriage life, about waiting and struggling for the presence of a baby in seven years marriage. The aim of the study is to analyze about how the main character, Tata, deals with her situation viewed from a feminist perspective. Using the Second Sex by Simone de Beauvoir this study explores how woman struggle to have a baby in her  marriage by  analyze the characters’ conversation. The finding reveal that one thing which affect woman’s character is her situation: patriarchal situation.",
      "date": [
        "2017-02-13T07:54:18Z",
        "2017-02-13T07:54:18Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112009010",
        "16020401",
        "http://repository.uksw.edu/handle/123456789/9854"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3406",
    "datestamp": "2014-01-28T06:20:26Z",
    "metadata": {
      "title": "Factors Contributing to Students' Silence in Integrated Course Classes",
      "creator": "Renata Candra Dewi, Priscilla",
      "contributor": [
        "Zacharias, Nugrahenny T.",
        "Kurniawati, Anita"
      ],
      "subject": [
        "silence",
        "silent",
        "participation",
        "Integrated Course"
      ],
      "description": "Having seen many peers were in silence during the Integrated Course (IC) class (ED 101), this study aims to explore factors that contribute to students' silence. Twenty English Department's IC students from class year 2012 of Satya Wacana Christian University participated in this study. In-depth interview was the chosen method of the data collection to explore the factors that contribute to students' silence. To analyze the findings, a descriptive qualitative methodology was used. From the interview, it was found that there were six major influential factors that contribute to the students' silence in IC classes. Those factors were: students' background knowledge, students' lack of interest, the role of dominating peers, students' language proficiency, students' preparedness, and the existence of grading rewards. The result indicated that teachers needed to create conducive situation to maximize the students' potentials in the learning process. This could be done by giving intensive encouragement for the students to be active in class through giving some participation points. Due to the limitation of this study, further researches need to be done to find out other factors, which contribute to the students' silence, in not only IC classes but also other classes. By having so many literatures about students' silence, it is expected that further solution can be found to avoid silence problems in EFL classrooms.",
      "date": [
        "2014-01-28T04:56:07Z",
        "2014-01-28T04:56:07Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008002",
        "13070817",
        "http://repository.uksw.edu/handle/123456789/3406"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/2524",
    "datestamp": "2013-05-15T01:31:34Z",
    "metadata": {
      "title": "Observing Students' Response Toward Material Authenticity in Senior High School",
      "creator": "Ismet Perkasa, Deilly",
      "contributor": [
        "Husada, Hendro Setiawan",
        "Astika, Gusti"
      ],
      "subject": [
        "Authentic",
        "non-authentic",
        "students’ response",
        "senior high-school"
      ],
      "description": "Teaching and learning material is an important aspect to increase the students' interest, enthusiasm, concentration, and enjoyment in English classroom learning. Since the issue toward material authenticity becomes a debatable issue among scholars and there are still a lot of arguments on how material authenticity is best applied, this study was aimed to find out the senior high-school students' response toward material authenticity. One research question was asked “How is students' response toward the material authenticity in the level of Senior High School?” Thirty first-grade students of SMA N 1 Salatiga were selected to be the participants of this study. They were taught using both materials, authentic and nonauthentic for 4 times. After that, they were asked to fill in the questionnaire (Peacock, 1997) which showed the students' responses toward both materials, authentic and non-authentic. Then, the data were analyzed based on two different categories proposed by Peacock (ibid.) which covered: (1) overall class interest & enthusiasm and (2) self-reported interest & enthusiasm. The results of the study indicated that the students' positive responses to authentic (80.55%) and non-authentic (81.46%) materials did not differ significantly",
      "date": [
        "2013-05-15T01:30:23Z",
        "2013-05-15T01:30:23Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "13040139",
        "112008021",
        "http://repository.uksw.edu/handle/123456789/2524"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3405",
    "datestamp": "2014-01-28T04:39:38Z",
    "metadata": {
      "title": "Academic Writing Students' Perceptions Toward Written Teacher Feedback On Their First Draft",
      "creator": "Natalia Sutresno, Christina",
      "contributor": [
        "Usadya Palupi, Victoria",
        "Nandari, Martha"
      ],
      "subject": [
        "perception",
        "feedback"
      ],
      "description": "This study explored Academic Writing students' perceptions toward written teacher feedback on their first draft in the English Department of Satya Wacana Christian University. The data were collected from interviews with 14 Academic Writing students of the English Department in a private university in Central Java. The kind of interview that was used in this study is semi-structured interview. This study resulted in four major themes. The first theme was about the students' feeling toward their first draft revision. The second theme was about students' expectation of the teacher comments. The third theme discussed about teacher comment on students' first draft and the last theme was about the students' perceptions toward a good teacher feedback. Finally, from the data, the study came to a conclusion that Academic Writing students had positive perceptions toward their teacher written feedback. They found it useful, especially in the content and organization aspect. The result of this study can be used for Academic Writing teacher to know what kind of feedback the students really need.",
      "date": [
        "2014-01-28T04:34:21Z",
        "2014-01-28T04:34:21Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008001",
        "13030346",
        "http://repository.uksw.edu/handle/123456789/3405"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7255",
    "datestamp": "2016-06-03T08:34:41Z",
    "metadata": {
      "title": "Marginalization as Perceived by Children in The Boy in the Striped Pyjamas and Life is Beautiful: a post-colonialism perspective",
      "creator": "Wardani, Arum Widya",
      "contributor": [
        "Kristono, Lany",
        "Maria L. A. F., Suzana"
      ],
      "subject": [
        "marginalization",
        "children",
        "racism",
        "post-colonialism"
      ],
      "description": "Racism is an inseparable part of human history and a common issue depicted in movies. A movie itself is more than just entertainment. It may imply human values, character building, social conflicts, art, history, as well as racism. Racism is an adults’ issue. Therefore, it is interesting to examine how children perceived marginalization toward the Jewish as depicted in The Boy in the Striped Pyjamas and Life is Beautiful. To reach that aim, the discussion section was divided into three parts i.e racism, slavery, and genocide which are portrayed in the scenes in both movies. From Post-colonialism perspective supported by a brief discussion on children’s characteristic, the analysis and interpretation reveal that children behave mostly by imitating what the adults do around them or by listening to adults’ explanation about things. This makes them perceived marginalization differently from adults because the idea of marginalizing others is far beyond their mindset who think all human are the same and; therefore, should be treated as equal. By reading this study, the readers of this paper will get a better understanding of how children perceive marginalization, particularly one addressed to a different race since children have a different way of perceiving marginalization from adults.",
      "date": [
        "2016-06-03T08:34:05Z",
        "2016-06-03T08:34:05Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008088",
        "13030462",
        "http://repository.uksw.edu/handle/123456789/7255"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3538",
    "datestamp": "2014-02-06T02:15:18Z",
    "metadata": {
      "title": "Investigating Teachers' Techniques in Teaching Reading to Rural Elementary School Students",
      "creator": "Ayuandika Maradani, Maya",
      "contributor": [
        "Astika, Gusti",
        "Listyani"
      ],
      "subject": [
        "Teaching Reading",
        "Techniques",
        "Elementary school",
        "Rural Area"
      ],
      "description": "There are several techniques of teaching reading that teachers can use to teach their students. However, the techniques should properly used and adjusted depend on the students' level and background knowledge. In order to teach English for young learners, especially when teaching reading to elementary school students in rural areas teachers should use appropriate techniques. Differences in level of study, information, and educational background knowledge of the students become the reason for teachers to select and use the good techniques. This study aimed to describe the techniques of teaching reading in rural elementary schools located in Kecamatan Suruh. The research participants were five English teachers from five different schools in Kecamatan Suruh. The data were collected using an observation and a semi-structured interview. The results of this study show four different techniques used by the teachers in teaching reading to their students. The reasons for using the techniques were also presented in this study.",
      "date": [
        "2014-02-06T02:12:20Z",
        "2014-02-06T02:12:20Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112009020",
        "16060538",
        "http://repository.uksw.edu/handle/123456789/3538"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/1933",
    "datestamp": "2013-04-15T06:37:16Z",
    "metadata": {
      "title": "Investigating Students' Reasons in Choosing Popular Graded Readers",
      "creator": "Widyaningsih, Sri",
      "contributor": [
        "Kusumaningtyas, Purwanti",
        "Donelson, Brandon"
      ],
      "subject": [
        "extensive reading",
        "graded readers",
        "students’ reasons"
      ],
      "description": [
        "Lembar Pengesahan tidak disertai tanda tangan dosen pembimbing",
        "Day and Bamford (1998) believed that Extensive Reading Class is a place to make the foreign language learners enjoy and like reading English materials. However, in Extensive Reading Classes of English Department (ED) Satya Wacana Christian University some students did not enjoy the reading materials, which were graded readers. The problem was it caused them to manipulate the assignment. They listed graded readers that they did not read in their reading list and only asked their friends to retell the stories. It meant the purpose of the class was not fulfilled because they did not enjoy the materials. Thus it is important to solve the problem. This study investigates the students' reasons in choosing popular graded readers which are graded readers that mostly read by students. Using the result, this study tries to minimize the manipulation by making the students interested to read the other unpopular graded readers. The participants are twelve students from six extensive reading classes 2010/2011 who read popular graded readers. Every participant was personally being\r\ninterviewed using semi structured interview then its transcripts were analyzed using content analysis (McKay, 2006). The dominant reason why the students borrow popular graded readers is because they had watched the movie adapted from those popular graded readers. They also like graded readers that are familiar to them. Thus, to minimize the manipulation done by the students, ED can promote the unpopul"
      ],
      "date": [
        "2013-04-15T06:36:05Z",
        "2013-04-15T06:36:05Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "12030240",
        "112007138",
        "http://repository.uksw.edu/handle/123456789/1933"
      ],
      "language": "id",
      "format": "application/pdf",
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5402",
    "datestamp": "2015-04-23T22:26:54Z",
    "metadata": {
      "title": "Students' Perceptions toward Teachers' Use of Bahasa Indonesia in English Learning Classroom",
      "creator": "Permatasari, Rike Rizkia",
      "contributor": [
        "Anita Kurniawati H",
        "Astika, I Gusti"
      ],
      "date": [
        "2015-03-10T08:08:20Z",
        "2015-03-10T08:08:20Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112007104",
        "14111527",
        "http://repository.uksw.edu/handle/123456789/5402"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7256",
    "datestamp": "2016-06-03T08:41:54Z",
    "metadata": {
      "title": "An Analysis of Learning Needs in ESP Course at Faculty of Information and Technology",
      "creator": "Pinandita, Indreswari",
      "contributor": [
        "Husada, Hendro Setiawan",
        "Sari, Sesilia Rani Setyo"
      ],
      "subject": [
        "learning needs",
        "ESP",
        "Information and Technology",
        "teaching materials"
      ],
      "description": "This study aimed at investigating learning needs perceived by students in ESP program of Faculty of Information and Technology (FIT), Satya Wacana Christian University (SWCU). One lecturer and 41 (n=41) students were involved as the participants of this study. The data were collected from a semi-structured interview and questionnaires which were adapted from Hutchinson & Waters’ study.The results of the study found that 91.89% of the participants were satisfied with what BIP 4 had offered. Most of the participants reported that the course had matched with the purpose of their study and they were also pleased with the teaching styles used in the classroom. They also pointed out that the lecturer was well-prepared and had shown good attitude in teaching. Finally, most of the participants’ responses also revealed that the teaching materials used in BIP 4 were also relevant to their needs and the classroom was comfortable to support their learning. It is recommended that further research with more partipants be undertakenin order to establish a greater degree of conclusiveness on this matter.",
      "date": [
        "2016-06-03T08:41:26Z",
        "2016-06-03T08:41:26Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008092",
        "13070872",
        "http://repository.uksw.edu/handle/123456789/7256"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7291",
    "datestamp": "2016-06-08T01:58:34Z",
    "metadata": {
      "title": "Students' Perceptions Toward the Implementation of Portfolio-Based Assessment in the Academic Reading Course",
      "creator": "Prastowo, Wahyu Bangkit",
      "contributor": [
        "Nandari, Martha",
        "Santoso, Petrus Ari"
      ],
      "subject": [
        "portfolio assessment",
        "portfolio",
        "students' perceptions"
      ],
      "description": "Portfolio-based assessment, is now increasingly and widely implemented in the higher education level, such as, in the university level. As it is strongly argued by Michelson & Mandell (2004) that portfolio actively engage learners in understanding the relationship between the culture of academic knowledge in higher education and that is required in the workplace. The purpose of this study was to find out the students' perceptions toward the  implementation of portfolio-based assessment in the academic reading course. The participants of the study were 100 intermediate level EFL students at the Faculty of Language and Literature (FLL) of Satya Wacana Christian University (SWCU) Salatiga, who have already taken Academic Reading course. A portfolio attitude questionnaire was mainly used as the main and the only instrument to collect the data in this study. The results of the study indicated that the participants of this study generally prefer to be evaluated by portfolio-based assessment rather than be assessed by traditional paper-pencil tests, and also most of the participants believed that portfolio-based assessment also contributes to their English learning processes. It was also found out that a number of the participants have positive attitudes towards portfolio assessment in their academic reading course.",
      "date": [
        "2016-06-08T01:58:09Z",
        "2016-06-08T01:58:09Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112009058",
        "13070878",
        "http://repository.uksw.edu/handle/123456789/7291"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/6014",
    "datestamp": "2015-06-04T07:42:26Z",
    "metadata": {
      "title": "Canting by Arswendo Atmowiloto: The Potrayal of Javanese Patriarchy and Women’s Challenge  Towards the Patriarchal System",
      "creator": "Oktavia, Listiarini Dwi",
      "contributor": [
        "Kusumaningtyas, Purwanti",
        "Maria L.A.F., Suzana"
      ],
      "subject": [
        "Javanese patriarchy",
        "feminism",
        "patriarchal challenge"
      ],
      "description": "Patriarchy is one of the  phenomena  that  are  found  in the Javanese society, who believe and do the patriarchal practices. The inequality between men and women and oppression  is the problem that women must face because of the idea of the men’s authority, and women should be subject to the authority   of men.  Canting, a novel written by Arswendo Atmowiloto, is one of very interesting novels which reflects the phenomena that happen in the society. It portrays how  the patriarchal  practices work  in Javanese society and the effort from a woman character, Ni, to fight for her rights as the reaction to the oppression towards her. This study is aimed to analyze how the novel portrays Javanese patriarchy and how it challenges Javanese patriarchy through the characters in the novel. Feminist criticism is used to conduct this research  and this novel  is  analyzed using characters analysis.  The finding is that patriarchy is still a culture that is held by the  Javanese  society represented by the character Pak Bei. He becomes the head of the family and thus he rule over his entire  family  member, and has  the power over his wife’s live  to decide everything in her life. Bu Bei, is the victims of the patriarchal practices. Though, through the character Ni, it shows that within the oppression of the system, women  can fight against the patriarchy, and struggle so that their lives are  not driven by the men authority. Education becomes important factor that brings Ni to the point where she struggle and protest against the system, to open Ni’s mind to see the gender unfairness and redefining herself as an equal creature compares to men",
      "date": [
        "2015-06-04T07:41:33Z",
        "2015-06-04T07:41:33Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "112008058",
        "13030363",
        "http://repository.uksw.edu/handle/123456789/6014"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5505",
    "datestamp": "2015-03-18T04:32:39Z",
    "metadata": {
      "title": "The Implementation of Cooperative Learning Through Group Work in English Teacher Education Program in English for Specific Purpose Course",
      "creator": "Pertiwi, Ika Ratna",
      "contributor": "Palupi, Victoria Usadya",
      "subject": [
        "Students’ perception toward the implementation of group work",
        "ESP students"
      ],
      "description": "This thesis focuses on the students‟ perceptions of the implementation of cooperative learning trough group work in English for Specific Purpose course (ESP) of English Teacher Education Program, Faculty of Language and Literature in private University in Salatiga. The data were collected by using Semi-structured interview to get richer data by following up participants‟ responses. There were 20 participants, all of them students who had taken the ESP course at the faculty program. The twenty participants were selected by convenience sampling. The data were analyzed and described qualitatively. In this study, the writer found that some students believed group work was beneficial and helpful to them, i.e. group work helped them to break down complex task into parts. However, some students dissatisfied toward shared-marks and unequal distribution of effort in group work. The finding also explored students‟ criteria of group work in order to improve cooperation among the group members.",
      "date": [
        "2015-03-18T04:32:39Z",
        "2015-03-18T04:32:39Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112010148",
        "14111754",
        "http://repository.uksw.edu/handle/123456789/5505"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/10578",
    "datestamp": "2017-03-30T01:45:31Z",
    "metadata": {
      "title": "Teachers' Perceptions of Their Use of L1 in Giving Instructions at SMP N 1 Banyubiru",
      "creator": "Pujiyanti, Retno",
      "contributor": [
        "Pattiwael, Athriyana Santye",
        "Widiningrum, Rindang"
      ],
      "subject": [
        "teachers' perceptions",
        "the Use of L1"
      ],
      "description": "English becomes one of the important courses in Junior High School. In teaching L2, the teacher still needs tu use L1 to help the students understand L2 better. Especially in giving instructions, the students have to really understand what they should do. This study is aimed to find out techers' perceptions of their use of L1 in giving instructions. This research used descriptive method. It was conducted in SMP N 1 Banyubiru, by taking two teachers as the participants. Those participanta were chosen randomly based on their willingness to be observrd and interwiewed. The data was collected by interviewing the participants and observing their teaching sessions. The obsernation was conducted three times for esch participant, so in total there are six obsrvations. The observations session showed that teacher 1 used L1 more rather than teacher 2. Furthermore, the finding reveals that the teachers have positive percep[tions of using L1 in giving instructions. However,they used L1 only in certain case like for calarifying their complex instructions. Using L1 considered important and useful in the case of helping the students to have better understanding to what they are expected to do.",
      "date": [
        "2017-03-30T01:45:01Z",
        "2017-03-30T01:45:01Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112011052",
        "16020473",
        "http://repository.uksw.edu/handle/123456789/10578"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9521",
    "datestamp": "2017-01-27T01:01:53Z",
    "metadata": {
      "title": "Classroom Instructions for Young Learners: a case study",
      "creator": "Corevelia, Erella Elen",
      "contributor": [
        "Kurniawati, Anita",
        "Kisnanto, Yustina Priska"
      ],
      "subject": [
        "classroom instructions",
        "young learners"
      ],
      "description": "This case study was conducted to describe about how a teacher in Elementary school in Parakan gave instructions to young learners in learning English. One research question underlie this study: How did a teacher in one Elementary School in Parakan give instructions to her young learner English students? The participant of this study was one teacher who is teaching English in Remaja Elementary School, Parakan. Observation was used to collect the data. It was done six times in the several classes in that particular school. Through the observations, the researcher found that the teacher used students’ first language (L1) dominantly in classroom instructions. The teacher also gave instructions in simple and clear way at the certain time. The teacher used appropriate level of language when giving instructions to the students. Then, the teacher also used gestures and students’ names in giving instructions to her young learners. Based on the findings, there are also some points the researcher suggests to young learner teachers.",
      "date": [
        "2017-01-27T01:01:02Z",
        "2017-01-27T01:01:02Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112012113",
        "16062288",
        "http://repository.uksw.edu/handle/123456789/9521"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5170",
    "datestamp": "2015-06-23T02:09:16Z",
    "metadata": {
      "title": "Problem in The Teaching of English as a Foreign Language to Students with Special Needs: a Case Study in an Inclusive School in Salatiga",
      "creator": "Prakarti, Adhitya Eka",
      "contributor": [
        "Palupi, Victoria Usadya",
        "Regawanti, Debora Tri"
      ],
      "subject": [
        "special need",
        "teaching problem"
      ],
      "description": "This study attempts to know how English  teaching learning process happened in the class  of students  with special needs,  what problems  the teacher  had  during  the teaching learning process,  and how  the teacher solved  the problem. This study was conducted in Sekolah  LuarBiasa  Bina Putra, Salatiga.  This study  used descriptive qualitative study and the subjects of the study were the English teacher of the school and his six  students  who suffered from Mild Retardation. The data for the study were collected from interviewing the teacher and 5 times of one-hour observations.  The data showed that the students had various responses that cause various problems such as complaining, cranky,  disinterest  of studying, and student's disabilities. Distraction from outside the class also became a problem for the both teacher and students during the class.  The teacher did some preparation to prevent problem. Some techniques were  also used to solve the problem like using AVA,  varied activity, teacher's assistance and encouragement, and simple materials.",
      "date": [
        "2015-02-04T02:30:04Z",
        "2015-02-04T02:30:04Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112006124",
        "14040327",
        "http://repository.uksw.edu/handle/123456789/5170"
      ],
      "language": "id",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3444",
    "datestamp": "2014-01-29T04:27:32Z",
    "metadata": {
      "title": "English Language Teaching Department Students' Identity Changes Associated With English Language Learning",
      "creator": "Feby Haryanto, Lourentius",
      "contributor": [
        "Indrayanti Timotius, Anne",
        "Zacharias, Nugrahenny T."
      ],
      "subject": [
        "Identity changes",
        "English language learning"
      ],
      "description": "English is regarded as an international language and because of that, most Indonesian students must learn English as foreign language (EFL). Considerably, learning any languages, including English is not only a matter of the language itself. It is also related to its culture‘s behavioral norms, and culture values that commonly determine self-identity of its users. This quantitative study investigated English Language Teaching Department students‘ identity changes associated with English language learning. The subjects were 85 English Language Teaching Department students of Satya Wacana Christian University, obtained from a purposive sampling. The instrument of the research was a closed-ended questionnaire about six categories of self-identity changes based on a study conducted by Gao Yihong, Cheng Ying, ZhaoYuan, and Zhou Yan (2005). According to literature of bilinguals‘ identities, those six categories of identity changes are: self-confidence, subtractive bilingualism change, additive bilingualism change, productive bilingualism change, identity split change, and the last one is zero change. The results showed that in the English Language Teaching Department of Satya Wacana Christian University EFL context, the most prominent identity changes type occurred on the learners was self-confidence.",
      "date": [
        "2014-01-29T04:25:08Z",
        "2014-01-29T04:25:08Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008032",
        "13070773",
        "http://repository.uksw.edu/handle/123456789/3444"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/17823",
    "datestamp": "2022-03-16T02:17:59Z",
    "metadata": {
      "title": "Collaborative Learning Among Learners to Enhance the Less-Proficient Students’ Learning in The ELT Classroom: A Case of A High School in Salatiga",
      "creator": "Nue, Marcelinus Pascalis",
      "contributor": "Mambu, Joseph Ernest",
      "subject": [
        "Collaborative learning",
        "peer interaction",
        "proficiency differences"
      ],
      "description": [
        "Tidak diijinkan karya tersebut diunggah ke dalam aplikasi Repositori Perpustakaan Universitas",
        "This study investigated whether collaboration among learners could facilitate the less proficient students’ learning or not. The data were obtained by interview and observation. The first interview was conducted to obtain the data from the teacher, and another data interview came from the less proficient student after the observation sessions. Both interview and observation results were analyzed qualitatively in terms of four collaborative elements by Kagan (1994, as cited in Lin, 2015), which were positive interdependence, individual accountability, equal participation and simultaneous interaction. In this study, the result of the teacher interview was related with the real situation during the group work observation. The findings of this study showed that collaborative learning among learners could facilitate the less proficient student’ learning, because it was coupled with the proper teacher’s strategy in conducting the group discussion. The teacher’s strategy was useful to manage a meaningful group discussion and decide the proper expert of each group. Besides, the high proficient student’s role, as the leader of the group, to promote the less proficient student to get involved in the discussion was significant. Finally, this study concluded that the four collaborative learning elements were mostly done by the students in the group work, and it completely helped the less proficient student’ learning."
      ],
      "date": [
        "2019-09-05T01:28:17Z",
        "2019-09-05T01:28:17Z",
        "2018"
      ],
      "type": "Thesis",
      "identifier": [
        "112014005",
        "18100201",
        "http://repository.uksw.edu/handle/123456789/17823"
      ],
      "language": "id",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/6010",
    "datestamp": "2015-06-04T04:25:09Z",
    "metadata": {
      "title": "Teachers’ Perceptions of  Pendidikan dan Latihan Profesi Guru (PLPG) on Professionalism",
      "creator": "Kurniawan, Octniel Dwi",
      "contributor": [
        "Timotius, Anne I.",
        "Kurniawati, Anita"
      ],
      "subject": [
        "professionalism",
        "teacher competences",
        "certification",
        "PLPG"
      ],
      "description": "Government has concerned about the  quality of teachers recently. Also, the need of professional teachers has increased significantly in the globalization era. According to  UU No. 19 Year 2005, a professional teacher must have 4 basic competences which are pedagogic, personality, social, and professional competence achieved through professional education program.    Certification is one of the professional education programs.  The certificate of educators can be obtained  through  Pemberian Sertifikat Pendidik secara Langsung  (PSPL),  (2) Portofolio  (PF),  (3) Pendidikan dan Latihan Profesi Guru  (PLPG),  or (4) Pendidikan Profesi Guru  (PPG). The purpose of this study is  to investigate teachers’ perception of the impact of PLPG on professionalism.   The research questions were: (1)  What are teachers’   perceptions on  professionalism?  and (2) Can PLPG really help teachers to be professional?  59 PLPG participants in SWCU  were given questionnaires which had 3 open-ended questions.  The result showed that there were  7 criteria of a professional teacher and PLPG could really help teachers to be professional. However, surprisingly, there were still some other teachers who did not become professional  after they had passed PLPG because of their wrong motives",
      "date": [
        "2015-06-04T04:23:38Z",
        "2015-06-04T04:23:38Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112007170",
        "13030456",
        "http://repository.uksw.edu/handle/123456789/6010"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9525",
    "datestamp": "2017-01-27T01:24:28Z",
    "metadata": {
      "title": "Teachers’ Perception of Difficulties in Teaching English for Elementary Students in SD Kristen Satya Wacana",
      "creator": "Tuhumury, Venda Vista",
      "contributor": [
        "Astika, Gusti",
        "Widiningrum, Rindang"
      ],
      "subject": [
        "perception",
        "difficulties",
        "young learners",
        "English"
      ],
      "description": "Nowadays, English becomes an International language that is used as a tool to develop some important aspects of life (Lauder, 2008). Knowing this issue, parents in Indonesia enroll their children to the school where English becomes a compulsory subject as early as possible starting from elementary even preschool. However, the teachers find it difficult to teach English for young learners. The aim of this study was to find out teachers’ perception of difficulties in teaching English at SD Kristen Satya Wacana. An in-depth interview of a sample of English teachers in SD Kristen Satya Wacana (3 participants) was conducted, focusing on teachers’ difficulties in teaching English. There were seven major difficulties faced by the participants in teaching English for elementary students. Those were the abolishment of bilingual class, Students’ background knowledge, the lack of time in English teaching, Classroom management, Children’s characteristics, slow learners VS fast learners, the role of parents.",
      "date": [
        "2017-01-27T01:23:53Z",
        "2017-01-27T01:23:53Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112012121",
        "16063288",
        "http://repository.uksw.edu/handle/123456789/9525"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5481",
    "datestamp": "2022-02-10T07:22:07Z",
    "metadata": {
      "title": "Politeness Strategy and Power in an Organization : Orders/ Requests From The Superior to the Subordinates",
      "creator": "Oktriana, Titania Tabita",
      "contributor": [
        "Rudianto, Christian",
        "Murtisari, Elisabet Titik"
      ],
      "subject": [
        "Politeness strategy",
        "Order/request",
        "Superior",
        "Subordinate",
        "Power"
      ],
      "description": "This study is about the use of politeness strategy in  an  organization in  the context of giving orders and making requests from the superior to the subordinate. Different ages  between the superior and the subordinate will be the focus case of this study, which is when the superior is younger than the subordinate. Because the superior has  organizational  power  and the subordinates  have social  power.  In Indonesia itself, age difference is important in the society, because social norms in Indonesia regulates the society to always respect the elder people.This study aims  to analyze whether there is politeness strategy used  by the superior or not  and the  type  of politeness  if there is any. The study had  been done in  a  religious organization,  PHMJ GPIB Tamansari Salatiga. By recording  threeweekly meetings, it is found out that the superior (head  chief) used politeness strategies while giving orders or asking requests to the subordinates. The indicatoris  adapted from Brown and Levinson (1987) to indicate the politeness strategy used by the superior. The strategy used by the superior is positive politeness and it is assumed that the superior want to have a good interpersonal relationship with the subordinates. Then,  the result proved  that the superior tend to pay attention more to the society power rather than keep her organization power.",
      "date": [
        "2015-03-17T03:01:15Z",
        "2015-03-17T03:01:15Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112010088",
        "14110802",
        "http://repository.uksw.edu/handle/123456789/5481"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/12860",
    "datestamp": "2017-11-01T03:19:06Z",
    "metadata": {
      "title": "A Study of Compliment and Compliment Responses Based on Gender Differences in  Live! With Kelly and Michael Show",
      "creator": "Wijayandaru, Juwita Kumara",
      "contributor": "Kendenan, Esriaty Sega",
      "description": "The purpose of this study is to investigate how male and female use compliment on “Live! With Kelly and Michael” show. It first explores the most topics of compliment used by male and female and the second is to explore the differences between male and female in responding the compliment. The participants of this study are the hosts of the show, Kelly and Michael, the celebrity guests (male and female) and the audiences. The data collection uses qualitative and quantitative approaches with 4 random videos chosen by the researcher to gather data. The data uses Herbert’s, the categorized of compliment topics Herbert’s (1998) and compliment responses Herbert’s (1986). The study finds that both female and male more frequently chose “performance/ skill/ ability” as the topic of compliment. It also shows that female and male have not many differences in responses the compliment. In addition, the result of this study shows us that in responses of compliment, both of female and male chose to agree or accept the compliment by use “appreciation token” sub-type.",
      "date": [
        "2017-11-01T03:18:31Z",
        "2017-11-01T03:18:31Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "392014526",
        "16061521",
        "http://repository.uksw.edu/handle/123456789/12860"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf",
        "application/pdf",
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Sastra Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/1934",
    "datestamp": "2013-04-15T06:40:52Z",
    "metadata": {
      "title": "The Common Causes of High School Students' Anxiety in Taking National Examination and Common Strategies Used to Reduce It",
      "creator": "Raditya, Bagus",
      "contributor": [
        "Maria L.A.F., Suzana",
        "Martha Nandari"
      ],
      "subject": [
        "anxiety",
        "national examination",
        "test anxiety"
      ],
      "description": [
        "Lembar Pengesahan tidak disertai tanda tangan dosen pembimbing",
        "National examination is one tool of evaluation issued by the government to measure learning achievement of learners and measure education quality. Just before the national examination, students faced a difficult moment on mental and psychological called test anxiety. The major aim of this study was to investigate common causes of high school students' anxiety in taking national examination and strategies used to cope their test anxiety. Sarason's (1978) theories about Test Anxiety Scale for gauging the level of anxiety were employed to analyze the level of test anxiety experienced by the students. The research of this study was conducted in five senior high schools in Semarang Regency and the sample were 50 third grader students of senior high school. The participants were surveyed using an openended questionnaire. The result of the study showed that all participants had never faced the national examination on senior high school level before and they were anxious toward it. The most common causes for their anxiety were worrying about the national examination result and the fact that students had not mastered the entire subjects that would be examined yet. The result also showed effects of test anxiety in students' learning process. Furthermore, this study found out that two most common strategies used to overcome their anxiety were studying harder in preparing the material and praying more often."
      ],
      "date": [
        "2013-04-15T06:39:43Z",
        "2013-04-15T06:39:43Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "12061057",
        "112007157",
        "http://repository.uksw.edu/handle/123456789/1934"
      ],
      "language": "id",
      "format": "application/pdf",
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9966",
    "datestamp": "2017-02-22T06:45:23Z",
    "metadata": {
      "title": "Display Question VS. Referential Question Asked by English Teachers of Seven Graders",
      "creator": "Dianti, Enggarianingtyas Putri",
      "contributor": [
        "Palupi, Victoria Usadya",
        "Ragawanti, Debora Tri"
      ],
      "subject": [
        "questioning",
        "display question",
        "referential question",
        "junior high school students"
      ],
      "description": "McComas and Abraham (2004) mentioned that the first step to ask a better question in classroom is that teacher is able to identify types of question he or she will ask. It is important for teacher because types of questions have different characteristics, purposes, and  output. This study was aimed to see which type of questions  (Display Question or Referential Question)  was dominantly asked by four English teachers from three different Junior High Schools through observations. Then, the questions  gathered from the observations  were sorted out based on the characteristic of Display Question and Referential Question. At last, it was put in a table to be counted and analyzed. The results showed that teachers asked more Display Question than Referential Question. And in order to see the value of asking Display Question and Referential Question, this paper attempted to analyzed the purposes of each types of questions. It was found that none of the participants asked Display Question to confirmation checks. Whereas, Display Question to comprehension check was asked by all teachers. For Referential Question, it was found that mostly teacher asked this type of question to invite students to share their ideas toward certain topics.",
      "date": [
        "2017-02-22T06:43:18Z",
        "2017-02-22T06:43:18Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112010026",
        "16020419",
        "http://repository.uksw.edu/handle/123456789/9966"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7328",
    "datestamp": "2016-06-09T08:56:26Z",
    "metadata": {
      "title": "English Department Students' Metacognitive Awareness of Strategies Used in Reading Academic Journals",
      "creator": "Irnasari, Devi",
      "contributor": [
        "Kurniawati, Anita",
        "Rudianto, Christian"
      ],
      "subject": [
        "metacognitive awareness",
        "reading strategies",
        "academic reading",
        "academic journal"
      ],
      "description": "Many university students found reading academic journals for the first time is a difficult task. They were burdened by the complex syntactic structures, unfamiliar vocabulary and unfamiliar discourse. The general aim of this study was to present a picture of the metacognitive awareness of reading strategy used when the students read academic journals. A hundred of students in the middle of their third year were asked to complete the survey of reading strategies (SORS) adapted from Moktari & Sheorey (2002). The overall result of the study showed that the participants were medium users of strategies with problem solving strategies as the most preferable strategy, followed by global and support strategies.",
      "date": [
        "2016-06-09T08:54:49Z",
        "2016-06-09T08:54:49Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112009161",
        "13090249",
        "http://repository.uksw.edu/handle/123456789/7328"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3460",
    "datestamp": "2014-01-30T02:39:03Z",
    "metadata": {
      "title": "An Analysis On Idiom Translation Strategies In The Rainbow Troops",
      "creator": "Ngestiningtyas, Mg. M. Frennandy",
      "contributor": [
        "Christina Eko Setyarini, Maria",
        "Titik Murtisari, Elizabet"
      ],
      "subject": [
        "descriptive qualitative",
        "idioms",
        "Laskar Pelangi",
        "translation strategies"
      ],
      "description": "This study is aimed at examining the translation strategies used in the translation of idioms in the novel Laskar Pelangi from Indonesian into English. The data were collected by listing the idioms in the source text and their corresponding translation in the target text, which is entitled, The Rainbow Troops; identifying the idioms by classifying the idioms found using McCarthy and O'Dell's theory about the classification of idiom types. The data obtained wereanalyzed by using idiom translation strategies proposed by Baker (2007). The most frequent translation strategies used in translating the Indonesian idioms is translation by using similar meaning and form. Other strategies applied are translation by using an idiom of similar meaning but dissimilar form, translation by paraphrasing. There is no idiom found using translation by omission or ellipsis strategy.",
      "date": [
        "2014-01-30T02:23:59Z",
        "2014-01-30T02:23:59Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008061",
        "13080700",
        "http://repository.uksw.edu/handle/123456789/3460"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5422",
    "datestamp": "2015-03-12T03:08:00Z",
    "metadata": {
      "title": "Student's Experience and Expectation of Using F-Learn",
      "creator": "Nimanuho, Laurensius Loli",
      "contributor": [
        "Rudianto, Christian",
        "Toar, Dian"
      ],
      "subject": [
        "experience",
        "expectation",
        "Moodle",
        "flexible learning",
        "F-learn"
      ],
      "description": "The internet has a big impact in education. There are a lot of web applications that can be used in education setting. One of the most used  application  is Moodle,  a free web application that educators can use to create online learning sites. SatyaWacana Christian University (SWCU) employs a Moodle software named F-learn (Flexible learning) since 2007. Since then, there  was  not  any  study seeking  students‘ perception  toward the use of F-learn in SWCU.  This study attempts to find out student‘s experience and expectation toward the use of Flearn in English Language Teaching setting. Participants are taken from Faculty of Language and Literature SWCU. In-depth interview  is chosen  as the method for this paper  because  it  is the best way to explore individual experience and expectation.  Result shows that participants are experiencing limited activities of using F-learn, and only  asynchronous  system activities.  Therefore,  most of participants find that the use F-learn so far is not effective, due to narrow activities they have experienced,  and also lack of teacher feedback, and poor quality internet connection.  The  later discussion points out  that participants wish that  online test, chat box/ direct message, and  discussion forum  can be used. They also expect that Dropbox system can be integrated to F-learn. This study also finds that participants suggest that in-class meeting cannot be replaced by distance learning, since  clarity is more negotiable when direct interaction happens in classroom.  Participants also expect that teachers still teach and explain unclear materials and give  appropriate and meaningful feedback to support and facilitate students‘ learning process.",
      "date": [
        "2015-03-12T03:06:03Z",
        "2015-03-12T03:06:03Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112009137",
        "14110874",
        "http://repository.uksw.edu/handle/123456789/5422"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/10477",
    "datestamp": "2017-03-23T07:54:36Z",
    "metadata": {
      "title": "Teachers' Strategies in Motivating Students in Inclysive School",
      "creator": "Andryastuti, Natasha Prasetyaning",
      "contributor": [
        "Setyarini, Maria Christina Eko",
        "Widiningrum, Rindang"
      ],
      "description": "Motivation has an important role in the teaching and learning  process.  This is  in line with what Mahadi & Jafari  (2012) believe that motivation can be the successful and useful issue in language learning. Motivational strategies are important, in fact, giving motivation sometimes is not  really  regarded by the teacher. This study aims to investigate the motivational  strategies that used by the teachers to motivate students who are learning in inclusive elementary school in Salatiga. There were 3 English teachers from three inclusive elementary schools that participated in this study.  To obtain the data, interviews  were used  as the instrument. The interview questions were adopted from Dörnyei’s (2001) stepwise approach. The result showed that the teachers used four strategies. Those strategies were creating the basic motivational condition, generating initial motivation, maintaining and protecting motivation, and encouraging positive selfevaluation.  The result of this study is hoped to  help teachers who are teaching in inclusive school to motivate their students in language learning.",
      "date": [
        "2017-03-23T07:54:01Z",
        "2017-03-23T07:54:01Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112011012",
        "16020449",
        "http://repository.uksw.edu/handle/123456789/10477"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5190",
    "datestamp": "2015-06-23T01:59:30Z",
    "metadata": {
      "title": "Context Analysis of Advertisement Taglines",
      "creator": "Ediningrum, Patria Sukma",
      "contributor": [
        "Rudianto, Christian",
        "Sumakul, Dian Toar Y.G."
      ],
      "subject": [
        "written text advertisement",
        "systemic functional linguistic",
        "genre",
        "register",
        "field",
        "tenor",
        "mode"
      ],
      "description": "There has been a big phenomenon when an ice cream product named Magnum Gold became very popular among some of the ice cream consumers. In order to promote the ice cream, Magnum Company created advertisements which are not only in form of audio visual but also in written form.  Written advertisement is more interesting to be studied because it is giving information to people and it also has the ability to influence the customers only by its text. Because of the appealing written advertisement, this study was  conducted to know the strength, the ability to influence the readers,  of Magnum written advertisement to engage the costumers.  The data of this study was Magnum Gold written advertisement which is shown in mass media. In order to analyze the written message in Magnum's tagline, this study used Systemic Functional Linguistic analysis  which drilled down and focused on genre and register. The results of this study show that by  doing  genre analysis,  Magnum advertisement is included as persuasive text. Then by doing the register analysis, field was analyzed to found that  the  readers  and Magnum Gold ice cream  have equal portion to be shown in the advertisement. This advertisement also combining mental, material, and relational process to create the readers' thought and reaction toward the advertisement and product.  Second analyzing was tenor which used to know  that the participant involved are the advertisement readers as the customers and also point toward as the pleasure seekers, and Magnum Gold ice cream.  The last part that analyzed was mode in order to  know the channel of this advertisement  which  already clear  that the channel of this advertisement is written.  The process of analyzing Magnum Gold written advertisement was presented in this study.",
      "date": [
        "2015-02-05T00:38:17Z",
        "2015-02-05T00:38:17Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112009035",
        "14040349",
        "http://repository.uksw.edu/handle/123456789/5190"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9889",
    "datestamp": "2017-02-17T03:03:39Z",
    "metadata": {
      "title": "Study of Discourse Markers in Classroom Communication",
      "creator": "Khurtina",
      "contributor": [
        "Setyarini, M. Ch. Eko",
        "Rudianto, Christian"
      ],
      "subject": [
        "discourse markers",
        "initiation",
        "active learnin",
        "classroom"
      ],
      "description": "Emphasising on the importance of Initiation-respond-feedback (IRF) in classroom communication,  this study focuses on a part of IRF which is initiation. This s tudy was conducted to describe the types of discourse markers given by Swan (2005) and Carter et al(2011)  which are used by teachers to initiate students so that active learning in classroom appear. Two selected teachers  in Padma Widyanata Easy English Course  are analyzed in 6 classroom observations. The data is explained in descriptive manner. The result of the observation is that  by ten types which are promoted by Swan (2005) and Carter et al (2011),  there are seven types of discourse markers which are used by teachers to initiate students' talk. They are starting conversation, response, ending a conversation, changing a topic,  showing surprise, ordering what we say and saying something in other ways. These markers work for teachers as    tools    to produce active learning.    The other three types, as reported in observation, are also used by both teachers but for other function. They used  the markers  such as sharing knowledge, sounding less direct, and type um and erm in order to manage explanation.",
      "date": [
        "2017-02-17T03:03:07Z",
        "2017-02-17T03:03:07Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112009112",
        "16020409",
        "http://repository.uksw.edu/handle/123456789/9889"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5188",
    "datestamp": "2015-06-23T02:03:52Z",
    "metadata": {
      "title": "Students' Attitude Toward Learning English in SD N Sumogawe 04",
      "creator": "Styaningrum, Dwi",
      "contributor": [
        "Astika, I Gusti",
        "Handoko, Martha Nandari S."
      ],
      "description": "Experts said that attitude toward learning English as a foreign language is a very important factor which can determine someone's success in learning language. The purpose of this study was to investigate students' attitude toward learning English in SD N  Sumogawe 04. The participants were 39 students: 22 fifth grade and 17 sixth grade students. A questionnaire was used to get the data about students' attitude toward learning English. Based on the data, the result shows that most of the students in SD N Sumogawe 04 have positive attitude toward learning English. Only a few students showed negative attitude. They realized that English is useful for them and they will continue to learn English. Although the students showed positive attitude, the students still  need support from the teacher.",
      "date": [
        "2015-02-04T08:19:32Z",
        "2015-02-04T08:19:32Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112009033",
        "14040311",
        "http://repository.uksw.edu/handle/123456789/5188"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5407",
    "datestamp": "2016-05-25T01:00:24Z",
    "metadata": {
      "title": "An Analysis of English Language Teaching Department Students' Perspectives Toward English",
      "creator": "Widodo, Ruth Alvina",
      "contributor": [
        "Timotius, Anne Indrayanti",
        "Setyarini, Maria Christina Eko"
      ],
      "subject": [
        "english perspectives",
        "global language",
        "additional language",
        "foreign language"
      ],
      "description": "There are many kinds of perspectives toward English  around the world, for example, English as foreign language, lingua franca, global language, etc,withtheir own characteristics. In Indonesia,there are possibly some perspectives as well.  This  descriptive quantitative  research investigates on which perspectives  are applicable  in Indonesia based on English Language Teaching Department (ELTD) students?  point of view.  Questionnaires  were  distributed to 100  ELTD  students.The questionnaires were about some statements toward English among ELTD students.The students  need to answer it by choosing number 1-5 that indicated strongly disagree to strongly agree.  As the result, the researcher found that ELTD students have 3  perspectives  toward English.  Based on the rank, the participants regarded English as global language  first,  English as an additional language second, and English as a foreign language third",
      "date": [
        "2015-03-11T07:39:24Z",
        "2015-03-11T07:39:24Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112008025",
        "14110796",
        "http://repository.uksw.edu/handle/123456789/5407"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7285",
    "datestamp": "2016-06-08T00:34:39Z",
    "metadata": {
      "title": "Applying \"Star Card\" as Rewards to Decrease Students' Misbehavior: an Action Research",
      "creator": "Prasasti, Ingkan",
      "contributor": [
        "Rudianto, Christian",
        "W., Rindang"
      ],
      "subject": [
        "classroom management",
        "student' misbehavior",
        "teaching method",
        "reward",
        "\"star card\""
      ],
      "description": "A student-teacher might have a little knowledge and experience about how to manage classroom condition and the students' misbehavior which might lead to the failure of implementing what the student-teachers have written in the lesson plan during Teaching Practicum program. This paper aims to improve the student-teachers' performance in dealing with the students' misbehavior through an action research. The writer provided one solution to decrease students' misbehavior, which is by applying \"Star Card\". The participants were one class of eight grade students that consists of 20 students in one of private junior high school in Salatiga. The finding of this research showed that applying \"Star Card\" as rewards in class is one of the effective ways to decrease students' misbehavior, because it increases students' motivation which made the students' do, listen, and behave better during teaching and learning process.",
      "date": [
        "2016-06-08T00:34:13Z",
        "2016-06-08T00:34:13Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112009041",
        "16060473",
        "http://repository.uksw.edu/handle/123456789/7285"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5440",
    "datestamp": "2015-03-13T01:49:22Z",
    "metadata": {
      "title": "English Teachers' Beliefs Toward the Use of Indonesian in English Class",
      "creator": "Suheru, Sharon Angela Ivana",
      "contributor": [
        "Anita Kurniawati H.",
        "Timotius, Anne Indrayanti"
      ],
      "subject": [
        "English teachers’ beliefs",
        "Indonesian (language)",
        "English classroom"
      ],
      "description": "This study raised a problem about the influence of English teachers' beliefs toward the use of Indonesian in English classroom. Then, the purpose of this study is to find out three English teachers' beliefs toward the use of Indonesian in English class . These three English teachers are teachers in one senior high school in Salatiga. Therefore, the question in this study is: “What are the three English teachers' beliefs toward the use of Indonesian in English class?” Besides, there are three major sources of teacher's beliefs that influence his/her beliefs toward the language use. They are: (1) experience as a language learner, (2) experience with schooling, and (3) experience as a teacher and what work best. Then, to get the data, this study used observation and semi-structured interview. The result of this study shows that all three sources above affect the three English teachers in using Indonesian. Their beliefs were that using Indonesian can make students understand more about the material; can help English teachers to explain some difficult expressions, vocabulary, and materials; and can unite the differences of students' background knowledge",
      "date": [
        "2015-03-13T01:48:07Z",
        "2015-03-13T01:48:07Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112010030",
        "14110784",
        "http://repository.uksw.edu/handle/123456789/5440"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/1093",
    "datestamp": "2021-03-24T03:47:19Z",
    "metadata": {
      "title": "The Use Of Drama Techniques in Teaching Speaking Skills",
      "creator": "Rupadhatu, Yolanda Rizalvera",
      "contributor": [
        "Manara, Christine",
        "Kurniawati, Anita"
      ],
      "subject": [
        "action research",
        "EFL teaching",
        "speaking skills",
        "drama techniques",
        "students’ attitude"
      ],
      "description": [
        "Lembar Pengesahan tidak disertai tanda tangan dosen pembimbing",
        "This study is based on a preliminary observation in an English lesson class in a junior high school. I found that students often are shy and unconfident to speak in English. They prefer to convey their idea written than spoken. Based on this preliminary observation, I decided to conduct this study. This study was conducted to explore the drama techniques in teaching speaking skills. It used an action research framework that was conducted in a private SMP in Salatiga. The samples used in this study are 8th grader students of 2010/2011 academic year. The study was conducted in in five lesson meetings. The techniques I used for the study are language game, mime, readers teather, and role play. As it was an action reseach, the analyses of the data were taken from observation notes and interviews. It was a cycled process, where the next activity is decided based on previous activity' reflection. The major findings of this study is that drama techniques work in reducing the students' anxiety and increasing oral fluency in speaking in English."
      ],
      "date": [
        "2012-12-06T07:22:42Z",
        "2012-12-06T07:22:42Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "112006011",
        "12060975",
        "http://repository.uksw.edu/handle/123456789/1093"
      ],
      "language": "en",
      "format": "application/pdf",
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9432",
    "datestamp": "2017-01-25T04:27:41Z",
    "metadata": {
      "title": "The Analysis of An EAP Textbook Used by the Students of Batch 2014 - 2015 of The Faculty of Economics and Business at Satya Wacana Christian University in Salatiga, Indonesia",
      "creator": "Setyowati, Nining",
      "contributor": [
        "Isharyanti, Neny",
        "Astika, Gusti"
      ],
      "subject": [
        "EAP",
        "textbook",
        "textbook evaluation",
        "need analysis",
        "economic students"
      ],
      "description": "Recently, a number of researchers has done a research about textbook evaluation in ESP context (Purnomo, 2009; Tous & Maryam, 2014; Kazem & Fatemeh, 2014; Baleghizadeh & Rahimi, 2011), since textbook is important in teaching and learning because it required materials and knowledge between students and teachers (Sarem, Hamidi, and Mahmoudie, 2013). The aim of this study was to analyze whether the EAP textbook used by the students of Faculty of Economic and Business in Satya Wacana Christian University, Salatiga, Indonesia meet the students’ English language learning needs or not. The study was done by answering two research questions; first, what are English language learning needs of Economic Faculty students? Second, do the EAP textbook used in Economic Faculty meet the students’ needs? 25 themes which were related to Economic fields and four skills in English language (writing, reading, listening, speaking) were used on the questionnaire to find the students’ English language learning need. The result of the questionnaire revealed that speaking skill was the most needed by students. In this case, the result of the questionnaire was matched with the result of the EAP textbook analysis. Findings pointed out that there were several themes with the skills needed by the students were not provided in the textbook. And finally, finding reported that the contents of the EAP textbook used by the Economic and Business Faculty may be inappropriate to meet all students’ English language learning needs.",
      "date": [
        "2017-01-25T04:26:36Z",
        "2017-01-25T04:26:36Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112011080",
        "16062304",
        "http://repository.uksw.edu/handle/123456789/9432"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5408",
    "datestamp": "2015-03-11T08:35:20Z",
    "metadata": {
      "title": "Students' Perceptions Toward Teacher's Uses of L1 in English Classrooms At SMA Negeri 3 Salatiga",
      "creator": "Mutiara, Kharisma",
      "contributor": [
        "Kurniawati, Anita",
        "Zacharias, Nugrahenny T."
      ],
      "subject": [
        "L1",
        "the teacher's uses of L1",
        "students' perceptions"
      ],
      "description": "There has been an issue whether the use of L1 in English classroom should be included or not. Some teachers allow the use of L1 and some do not. For the teachers who agree with the use of L1, they see  L1 as a valuable tool for learning, but  some believe that L2 is best learned monolingually. The study on the use of L1 in teaching English here to give insights about students? perceptions toward the teacher?s  use of L1 in English  classroom.  The purpose of this study is to  explore  students?  perceptions  toward  the  teacher?s  use of L1 in English classroom for senior high school. This study used questionnaires distributed to 119 senior high students  to collect the data. The result revealed almost all the  students agree that the teacher?s use of L1 in English classroom is necessary.  The students also showed positive perceptions toward the teacher?s use of L1 for  clarifying purpose, a tool to check students? understanding, a tool to explain new vocabularies, a tool to explain grammar, helping students to perform L2 better, and reducing learner?s anxiety.  From this study hopefully can  provide  a clear  perspective  about how students perceived toward the teacher?s use of L1 in English classroom, and  the teachers  will be more aware about their students? perceptions in using L1 in their English class, so that the teachers can use L1 and TL judiciously inside the classroom.",
      "date": [
        "2015-03-11T08:33:10Z",
        "2015-03-11T08:33:10Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112008031",
        "14110833",
        "http://repository.uksw.edu/handle/123456789/5408"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3486",
    "datestamp": "2014-02-03T04:07:42Z",
    "metadata": {
      "title": "The English Language Teaching students' beliefs toward English Language Teaching in the era of World Englishes",
      "creator": "Febriana Suryaningtyas, Aulia",
      "contributor": [
        "Zacharias, Nugrahenny T.",
        "Astika, Gusti"
      ],
      "subject": [
        "beliefs",
        "World Englishes",
        "materials",
        "mother tongue",
        "culture"
      ],
      "description": "This study was conducted to analyze the English Language Teaching students' beliefs toward English language teaching in the era of World Englishes. The participants of the study were one hundred participants of English Language Teaching, Satya Wacana Christian University from all existing batches. This study used quantitative research, but it was elaborated qualitatively. The findings of the research were organized by breaking the research question down into three sub-research questions. The first finding showed that western-published materials were more preferable since it could serve as a language model. The second finding showed that the use of students' mother tongue in the classroom was considered necessary by the participants to help them catch the teachers' explanation easily. However, the teachers merely occasionally used it in the classroom practice to make their students master English well. The last finding showed that ELT students agreed that the students should learn the cultures from English-speaking countries to avoid misunderstanding and also to enhance students' awareness of cultural diversities about the language they learnt. However, the teacher sometimes related the topic of the materials with the students' cultures in classroom practice. It meant that learning English-speaking countries' cultures made the students become more aware of other cultures and therefore, they could enrich their knowledge. The study suggests that according to the participants, both English and local cultures are important considerations in English language teaching in the era of World Englishes.",
      "date": [
        "2014-02-03T04:06:00Z",
        "2014-02-03T04:06:00Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008131",
        "13050407",
        "http://repository.uksw.edu/handle/123456789/3486"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/10306",
    "datestamp": "2017-03-16T07:05:56Z",
    "metadata": {
      "title": "An Analysis of Students' Perceptions toward the Use of Positive Reinforcement in the English Classroom: The Case of Students of SMP Kristen Satya Wacana (SMP Lab UKSW) Salatiga",
      "creator": "Pratiwi, Imaroh Mega",
      "contributor": [
        "M., E.Titik",
        "Handoko, Martha Nandari S."
      ],
      "subject": [
        "students' perception",
        "positive reinforcement",
        "motivation"
      ],
      "description": "In motivating students, sometimes teachers do not know how to deal with this problem. Mainly,it is because students less of confidence in discissing with teachers. Students also do not perform better in the class because of the less of confidence. This study examined the perceptions of students toward the use of positive reinforcement in the English classroom at SMP Lab UKSW Salatiga, Central Jva, Indonesia. The data were collected from the questionnaires that were given to 80 students grade VIII SMP Lab UKSW Salatiga, Centeral Java, Indonesia. Close-ended questionnaire was used to know about students' perceptions. the data were analyzed using SPSS software. The finding shows that almost all of students agreed that the use of positive reinforcement has positive impacts. those impacts consist of students' attendance. students' grade, and students'confidence. It was also found that the use of positive reinforcement might increase students'motivation and also could reduce inapporopriate behavior. Students believed they will perform better in the class with the increase of motivation.",
      "date": [
        "2017-03-16T07:04:57Z",
        "2017-03-16T07:04:57Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112010147",
        "16020438",
        "http://repository.uksw.edu/handle/123456789/10306"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/1621",
    "datestamp": "2013-03-26T04:47:49Z",
    "metadata": {
      "title": "Pronunciation Errors Made by the Students of Transactional Speaking",
      "creator": "Norani Warihintyas, Antonia",
      "contributor": [
        "Husada, Hendro Setiawan",
        "I. Timotius, Anne"
      ],
      "subject": [
        "English Pronunciation",
        "Pronunciation Errors",
        "Segmental Errors"
      ],
      "description": [
        "Lembar Pengesahan tidak disertai tanda tangan dosen pembimbing",
        "This study explored the pronunciation error faced by the Transactional Speaking students in the English Department of Satya Wacana Christian University. One research question asked what are the pronunciation errors faced by the Transactional Speaking students in English Department of Satya Wacana Christian University. 16 participants participated in this study. The data were collected from minimal pair and reading story tests. To pin point the students` pronunciation errors, two native speaker teachers were involved in both tests. The results of this study show that based on minimal pair test the 5 consonants /z/, /θ/, /ʒ/, /g/ and /t∫/ and 5 vowels /ɔ/, /e/, /oʊ/, /aʊ/ and /ε/ were difficult to pronounce and based on reading story test the sounds /d/, /t/, /i/ and /aI/ caused errors in the students` pronunciation, also the sounds /v/, /∫/, /dʒ/, /ð/, /I/ and /æ/ proved to be problematic to the students."
      ],
      "date": [
        "2013-03-26T04:46:12Z",
        "2013-03-26T04:46:12Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "12030588",
        "112007064",
        "http://repository.uksw.edu/handle/123456789/1621"
      ],
      "language": "en",
      "format": "application/pdf",
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/1603",
    "datestamp": "2013-03-26T01:52:16Z",
    "metadata": {
      "title": "The Correlation Between Student's English Daily and Final Semester Tests at Automotive Department of SMK N 2 Salatiga",
      "creator": "Krisna Nurwiyati, Ika",
      "contributor": [
        "Astika, Gusti",
        "M.T Fanny Novita Atmadjaja, C."
      ],
      "subject": [
        "Correlation",
        "the Daily Test Score",
        "the Final Semester Score"
      ],
      "description": [
        "Lembar Pengesahan tidak disertai tanda tangan dosen pembimbing",
        "This study attempted to find out the correlation between the daily tests scores and final semester test scores. This study was conducted in SMK N 2 Salatiga in the 2010 – 2011 academic year. The participants of this study were 72 students from 2 classes of eleventh grade students of automotive department. The data for this study were the students' daily tests scores and final semester test scores. The data were correlated using Spearman Rank Order Coefficient Test. The finding shows that there is no correlation between daily test scores and final semester test scores."
      ],
      "date": [
        "2013-03-26T01:50:51Z",
        "2013-03-26T01:50:51Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "12040658",
        "112005168",
        "http://repository.uksw.edu/handle/123456789/1603"
      ],
      "language": "en",
      "format": "application/pdf",
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9524",
    "datestamp": "2017-01-27T01:19:31Z",
    "metadata": {
      "title": "A Critical Discourse Analysis of Advertising Language Used in “Femina” and “Prestige” Magazines",
      "creator": "Suryatno, Stephanus",
      "contributor": [
        "Isharyanti, Neny",
        "Mambu, Joseph Ernest"
      ],
      "subject": [
        "critical discourse analysis",
        "beauty advertisements",
        "language features",
        "textual analysis"
      ],
      "description": "Advertising in era globalization becomes an \"effective tool\" for companies to offer their products, good and services, but there are some negative sides regarding content because its contents tend to be “powerful, persuasive and manipulative”. Beauty product advertisements commonly portray stereotypes of standard \"beautiful\" person through the language features used in the advertisement. The advertiser also uses language features to build an image of the product and build a relation to the audiences in certain ways. This phenomenon requires readers to be more aware and critical when reading of advertisements. By using Critical Discourse Analysis (CDA)’s Fairclough model as a framework, this study attempts to compare beauty products advertisements between two woman magazines. Language features show power relation between advertisers and audiences on the mood choice. It shows the position of advertisers and audience. Language features show how advertisers build a relationship to their audience and how they build an image of their products in personalization, cohesion, parallelism, modality, and disjunctive syntax.  The language used in advisements also bring to stereotypes about “ideal” woman stereotypes through their vocabularies and adjectives because both magazines have different views about ideal appearances of a woman. Prestige portrays woman as “friend” to the man, and Femina portrays woman as “wife” to their husband. The beauty advertisements are taken from Prestige magazine which has a high-class audience and Femina magazine that has medium to lower class of audiences. Both magazine published from September 2015 until June 2016. The result is that two magazine uses certain ways in the use of language features to build image and relation.",
      "date": [
        "2017-01-27T01:14:17Z",
        "2017-01-27T01:14:17Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112012120",
        "16062373",
        "http://repository.uksw.edu/handle/123456789/9524"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/17854",
    "datestamp": "2022-03-16T01:52:25Z",
    "metadata": {
      "title": "Teachers’ Perceptionson Intergrating Cultural Contents in English Language Teaching at Junior High Schools, Salatiga",
      "creator": "Idadi, Novia Australiane",
      "contributor": "Kurniawati, Anita",
      "subject": [
        "ELT",
        "culture",
        "target culture",
        "benefit",
        "challenges"
      ],
      "description": "Language is an expression of culture. Therefore, it is essential for language learners to become aware of the culture of the language learnt. The challenge for English teachers in Indonesia is how they will integrate cultural content in their English classrooms with Indonesia students as their audience. That was because Indonesia students already have their own culture. The aim of this research is to explore teachers’ perspectives in integrating cultural content in their English language classes. This is a qualitative research with 10 English Junior High School (JHS) teachers as participants. These participants age range vary from 24-56 years old, with teaching experience ranging from 3 – 25 years. Data were collected using semi-structured interview and then grouped based on reoccurring themes. This research shows that teachers have positive perspectives on integrating cultural content in their English classes. Integrating cultural content is believed to be beneficial in raising awareness to cultural diversity, increasing sensitivity to source culture and also giving examples of good practices that exist in other culture. In practical level, participants of this research is not only including English and Indonesia culture as target and source culture, but also other nations’ cultural examples to broaden the students’ perspectives. Admittedly, there are challenges in doing this, as found in this research. Students’ attachment and familiarity toward source culture has proven to be the main factor that challenged them to relate, understand and implement the target culture in their English language learning.",
      "date": [
        "2019-09-11T01:40:09Z",
        "2019-09-11T01:40:09Z",
        "2018"
      ],
      "type": "Thesis",
      "identifier": [
        "112014018",
        "18100209",
        "http://repository.uksw.edu/handle/123456789/17854"
      ],
      "language": "id",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9422",
    "datestamp": "2017-01-25T03:27:15Z",
    "metadata": {
      "title": "The Use of the Word ‘Galau’ Among Contemporary Youth",
      "creator": "Antonio, Kevin",
      "contributor": [
        "Murtisari, Elisabet Titik",
        "Setyarini, Maria Christina Eko"
      ],
      "subject": [
        "Indonesian youth",
        "semantic change",
        "‘galau’"
      ],
      "description": "In Indonesia, the word ‘galau’ is understood as an expression that shows negative emotions due to a serious problem and as a standard form to poetic word (written form) normally back then. According to Indonesian Dictionary (Kamus Besar Bahasa Indonesia) (2015), the word ‘galau’ means busy abuzz (sibuk beramai-ramai) or very crowded. In spite of this, there seems to be a shift of how it is used among Indonesian youth. Thus, this current study aims to understand how young people use the word ‘galau’ and does ‘galau’ experiencing a semantic change. The participants were one hundred students of faculty of language and literature in Satya Wacana Christian University. Questionnaires were distributed to one hundred youth of around eighteen to twenty-four years of age in any batches. The findings show that ‘galau’ is narrowing in meaning. Furthermore, the word ‘galau’ now seem to belong to more of informal register and frequently appear in daily conversation. Although, it still refers to “confused”, “sad”, or, “restless”. and the subjective level of the uncomfortable feeling seems to have decreased from ‘galau’ back then. At last but not least, I hope this research can help students to understand semantic change that happened in Indonesia.",
      "date": [
        "2017-01-25T03:26:37Z",
        "2017-01-25T03:26:37Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112011043",
        "16062483",
        "http://repository.uksw.edu/handle/123456789/9422"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5406",
    "datestamp": "2015-03-11T07:23:33Z",
    "metadata": {
      "title": "A Link Between Teachers' Beliefs and Classroom Practive on Using Storytelling to Teach English to Kindergarten Students",
      "creator": "Sulistiawati, Estriani Hana",
      "contributor": "Kurniawati, Anita",
      "subject": [
        "teachers‘ beliefs",
        "classroom practice",
        "storytelling",
        "teaching English"
      ],
      "description": "In teaching English, it is  important to  explore the teacher‘s beliefs which underlie teachers‘ practice in classroom. As a consequence, the writer inquired about how the classroom practice reflects the teachers‘ beliefs on using storytelling to teach English to kindergarten students. The writer conducted a research based on the research question abouthow the classroom practice reflect the teachers‘ beliefs on using storytelling to teach English to kindergarten students.  The aim of the study was  investigating the relationship between  the teachers‘ beliefs and their practices in  using storytelling to teach English in kindergarten schools,  Salatiga.  The present study employed a qualitative method. The instrument of data collection was  structured interview.  The sample of the study consisted of 10 teachers from 2 different Kindergarten schools in Salatiga.  The findings showed  a) The  classroom  practice on using storytelling b) Storytelling is beneficial.  This present study was  conducted to make the teachers aware of the relationship between their classroom practice and their beliefs.  Einardottir (2003) argues that raising teachers‘ awareness of their beliefs is an important aspect in curriculum development and teacher education (cited in Fleer, 2010)",
      "date": [
        "2015-03-11T07:17:54Z",
        "2015-03-11T07:17:54Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112008004",
        "14110814",
        "http://repository.uksw.edu/handle/123456789/5406"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/1607",
    "datestamp": "2013-03-26T02:34:57Z",
    "metadata": {
      "title": "Culture Shock and Academic Culture Shock Experienced by Satya Wacana Christian University Students from Soe",
      "creator": "Ndaomanu, Meilani",
      "contributor": [
        "Husada, Hendro Setiawan",
        "Rudianto, Christian"
      ],
      "description": [
        "Lembar Pengesahan tidak disertai tanda tangan dosen pembimbing",
        "This study aimed to find out what kind of culture shock and academic culture shock experienced by Satya Wacana Christian University students (SWCU). The participants of this study were 70 students who come from Soe. The data of this research were collected from a 30 question questionnaire that adapted from Levine and Mara (1993), Hu (2008) and Kathleen (2006) and was used to measure the culture shock academic culture shock. The result of this study shows that the students experienced culture shock. Place ranked the highest (87,12%) followed by language (63,57%). On the third place was physical appearance (43,55%), and the last was supports and food (37,14%). They also experienced academic culture shock because of the difference of students-teacher relationship (68,60%), the use of technology (65,35%), learning style (44,67%), teaching methodology and curriculum (26,77%)."
      ],
      "date": [
        "2013-03-26T02:33:35Z",
        "2013-03-26T02:33:35Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "12040569",
        "112006078",
        "http://repository.uksw.edu/handle/123456789/1607"
      ],
      "language": "en",
      "format": "application/pdf",
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9509",
    "datestamp": "2017-01-26T09:26:26Z",
    "metadata": {
      "title": "Student-Teachers’ Perceptions towards The Use of Teaching Journal in a Teaching Practicum Program",
      "creator": "Prasetya, Retrianti",
      "contributor": [
        "Palupi, Victoria Usadya",
        "Mambu, Joseph Ernest"
      ],
      "subject": [
        "reflective teaching",
        "reflective journal",
        "teaching journal",
        "teaching practicum program",
        "reflective behavior"
      ],
      "description": "The aim of the present study is to see student-teachers’ perceptions towards Teaching Journal which is the requirements in Teaching Practicum Program in English Language Education Program at Faculty of Language and Arts, Universitas Kristen Satya Wacana. The data in this study were collected using Interview with 25 student-teachers who have taken Teaching Practicum Class at different secondary schools in Salatiga. The data showed that 20 out of 25 student-teachers were aware that writing Teaching Journal was helpful for them to be able to reflect and improve into their teaching performances. Meanwhile, 5 student-teachers stated that writing Teaching Journal was not necessary and are tiring. This study is hoped to be useful for educational practitioners especially student-teachers to raise their awareness of writing teaching journals in order to reflect and learn on their own mistakes and previous experiences in teaching.",
      "date": [
        "2017-01-26T09:25:40Z",
        "2017-01-26T09:25:40Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112012075",
        "16063283",
        "http://repository.uksw.edu/handle/123456789/9509"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/1924",
    "datestamp": "2013-04-15T03:30:15Z",
    "metadata": {
      "title": "Students' Perceptions about Their Thesis Topic Choice and the Implication It Has on Their Attitude/Mood about Their Thesis Writing Process",
      "creator": "Niken Pratiwi, Cynthia",
      "contributor": [
        "Donelson Sims., Danielle",
        "Hendro Setiawan Husada"
      ],
      "subject": [
        "Thesis",
        "Topic selection",
        "Reasons in choosing topic",
        "Students’ perception"
      ],
      "description": [
        "Lembar Pengesahan tidak disertai tanda tangan dosen pembimbing",
        "This present study aimed to investigate the implication of the students' thesis topic choice on their feelings about their thesis and how it affected their writing process. It also addressed the following questions: a) “How do the students get their thesis topic and how is their feeling about their choice?” b) “What are the students' perceptions about their thesis topic choice and the implication it has on their attitude/mood about their thesis writing process?” The participants consisted of 10 fourth year students enrolled in Thesis and Thesis Lanjut classes offered at English Department, Satya Wacana Christian University. The data came from 10 semi-structured interviews. The transcripts of the interviews are then being analyzed using a categorical-content analysis to seek the emerging themes. The study found two major findings. Pedagogical implications of the findings will also be addressed at the end of the paper."
      ],
      "date": [
        "2013-04-15T03:29:00Z",
        "2013-04-15T03:29:00Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "12071035",
        "112007020",
        "http://repository.uksw.edu/handle/123456789/1924"
      ],
      "language": "en",
      "format": "application/pdf",
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/1927",
    "datestamp": "2013-04-15T04:21:20Z",
    "metadata": {
      "title": "Portrayal of Women Identities in The Two Main Characters of Cerita Calon Arang by Pramoedya Ananta Toer and Janda Dari Jirah by Cok Sawitri",
      "creator": "Tehusalawany, Christa A. Y.",
      "contributor": [
        "Kusumaningtyas, Purwanti",
        "Maria L. A. F., Suzana"
      ],
      "subject": [
        "Simone de Beauvoir",
        "identity",
        "behavior",
        "beauty",
        "the Object",
        "the Subject"
      ],
      "description": [
        "Lembar Pengesahan tidak disertai tanda tangan dosen pembimbing",
        "Many people still see women as the second class in the society. The identity of a woman is determined by society. The study uses two stories, Cerita Calon Arang and Janda dari Jirah which have same characters but, have different version of telling the events. The theory of Simone de Beauvoir, the Second Sex, helps this study to see how Cerita Calon Arang and Janda dari Jirah portray women's identities based on their behavior and beauty. Society has its own standards about the behavior and beauty of women which according to Beauvoir limits women to experience more knowledge. The study focuses only on the main characters in both stories, Calon Arang and Ibu by analyzing how these characters interact with other characters. Calon Arang, a woman who is characterized as a cruel witch, is the Object (identity) because what she chooses for her life and how society judges her looks does not meet the standards. She is the symbol of evilness in her society so that people needs a hero, in this case is a man. On the other hand, Ibu, a woman who is characterized as good witch, is the Subject (identity). What she does and how society judges her looks is acceptable. People respect her. Being the Subject, it redefines the idea of Beauvoir that even though women live in what society expects her to be, she can still be the Subject."
      ],
      "date": [
        "2013-04-15T04:00:11Z",
        "2013-04-15T04:00:11Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "12070761",
        "112007090",
        "http://repository.uksw.edu/handle/123456789/1927"
      ],
      "language": "id",
      "format": "application/pdf",
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9473",
    "datestamp": "2017-01-26T01:26:18Z",
    "metadata": {
      "title": "Teachers’ Challenges in Teaching English to Young Learners in Rural Public Primary Schools in Salatiga",
      "creator": "Rahayu, Veronica Widya Tri",
      "contributor": [
        "Kurniawati, Anita",
        "Kisnanto, Yustina Priska"
      ],
      "subject": [
        "teaching English for young learner",
        "rural schools",
        "teachers’ challenges",
        "curriculum",
        "teachers’ competencies",
        "parents’ socio-economic status"
      ],
      "description": "It is believed that rural education has a legacy unique challenge as compared with that of their urban and suburban counterparts. The challenges are also found in the place and the implementation of English program in primary level. Therefore, the aim of this study is to investigate the challenges encountered by English teachers in teaching English for young learners in rural public primary schools in Salatiga, Central Java. To answer the question, semi-structured interview is used with eight participants from eight primary schools in four sub-districts (Argomulyo, Tingkir, Sidorejo, and Sidomukti) in Salatiga. It launches by briefly discussing the place of English in national curriculum for primary school in one hand and the execution of English program in rural schools on the other hand. Throughout the research, the researcher obtained three challenges and those were: (i) the status of English as a local content subject creates conditions which is less supportive for the teachers to teach English, (ii) most of the teachers are coming from non-English educational background which influence their competencies in teaching English, (iii) socio-economic status from parents plays a big role in students’ motivation and achievement in learning English.",
      "date": [
        "2017-01-26T01:24:51Z",
        "2017-01-26T01:24:51Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112012033",
        "16062149",
        "http://repository.uksw.edu/handle/123456789/9473"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9516",
    "datestamp": "2017-01-26T10:31:34Z",
    "metadata": {
      "title": "The Use of Student Talk to Teach Pronunciation to Eight Graders in SMPN 7 Salatiga",
      "creator": "Ristiani, Dwi",
      "contributor": [
        "Timotius, Anne Indrayanti",
        "Palupi, Victoria Usadya"
      ],
      "subject": [
        "pronunciation",
        "student talk",
        "correction",
        "and practices"
      ],
      "description": "Pronunciation is very important to have good communication in English. Some problems may happen if people communicate using wrong pronunciation. For example, miscommunication can have the consequences of information not being transferred to other people. As teachers, we might find difficulties in teaching pronunciation because we have to deal with students’ native language which might influence the students’ English pronunciation (Zhang & Yin, 2009). Moreover, insufficient students’ knowledge of English also becomes one of the problems in learning English pronunciation(Zhang & Yin, 2009). The objective of this study was to understand teacher’s perception toward the use of student talk to teach pronunciation to eight graders students in SMPN 7 Salatiga. Student talk is one of activities that is used to teach pronunciation (Griffith, 2004). Moreover, this study used interview and observation to obtain the data and also used qualitative research to analyze the result. The findings were grouped into several themes. First, was the concept of student talk as an activity which gave a chance for students to practice their pronunciation in pairs or in groups.  The second theme related to the differences and similarities of its application in class. Third, were the perceived advantages of student talk in helping students improve their skill in pronunciation through practicing and correction. Student talk is limited since it cannot reach all types of students. The last theme was related to the teachers’ belief on the way correction was given and how the students responded to the teachers’ correction.",
      "date": [
        "2017-01-26T10:31:03Z",
        "2017-01-26T10:31:03Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112012094",
        "16063341",
        "http://repository.uksw.edu/handle/123456789/9516"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/719",
    "datestamp": "2013-04-15T08:05:37Z",
    "metadata": {
      "title": "The Correlation Between Students' Self-Assessment in Listening and Listening Scores",
      "creator": "Juliansa, Devi",
      "contributor": [
        "Astika, Gusti",
        "Husada,Hendro Setiawan"
      ],
      "subject": [
        "correlation analysis",
        "self-assessment",
        "listening"
      ],
      "description": [
        "Lembar Pengesahan tidak disertai tanda tangan dosen pembimbing",
        "The purpose of the present research was to find out whether there was any correlation between students' self-assessment in listening and listening scores. The participants of this research were 46 students of English Department of Satya Wacana Christian University taking an Interpersonal Listening course. They were asked to fill in the questionnaires which had 3 parts: before listening, while listening, and after listening. The data for the research were from the questionnaires that were adapted from Chen's Exploring Taiwanese College Students' Strategy Development study with several adjustments to make it appropriate the gauge the self-assessment phenomenon. The result of the correlation shows that there was no significant correlation between students' self-assessment in listening and listening scores. The paper concludes with discussions of, and implication for, listening skill and implementing self-assessment for students."
      ],
      "date": [
        "2012-11-02T06:21:43Z",
        "2012-11-02T06:21:43Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "112008143",
        "12030269",
        "http://repository.uksw.edu/handle/123456789/719"
      ],
      "language": "en",
      "format": "application/pdf",
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9459",
    "datestamp": "2018-04-16T09:00:17Z",
    "metadata": {
      "title": "Investigation of Metacognitive Reading Strategy in Academic Writing Class",
      "creator": "Ratri, Permata Dipaning",
      "contributor": [
        "Kurniawati, Anita",
        "Murtisari, Elisabet Titik"
      ],
      "subject": [
        "reading",
        "reading comprehension",
        "reading strategy",
        "metacognitive",
        "metacognitive reading strategy"
      ],
      "description": "The aim of this study was to investigate what kind of metacognitive strategies which was used in the Academic Writing class. The participants of this research were 60 Academic Writing Course students of batch 2014 of English Language Education Program of Satya Wacana Christian University. To answer the research question, closed-ended questionnaire were selected as the instruments of the research.  This questionnaire categorized metacognitive reading strategy into three main categories which were planning, monitoring, and evaluating strategies. The result of this study showed that the participants applied the planning and monitoring strategy, but the majority of the participants did not apply the evaluation strategy in their reading activity. From those findings, the implication of the study showed that the teacher should introduce the evaluating strategy to the students.",
      "date": [
        "2017-01-25T09:32:31Z",
        "2017-01-25T09:32:31Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112012016",
        "16062147",
        "http://repository.uksw.edu/handle/123456789/9459"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5409",
    "datestamp": "2015-03-11T08:44:22Z",
    "metadata": {
      "title": "Teachers' Perceptions Toward Bilingual Policies in Teaching English for The Early Learners",
      "creator": "Landum, Jessica Natalia",
      "contributor": [
        "Kurniawati, Anita",
        "Rudianto, Christian"
      ],
      "subject": [
        "teachers’ perception",
        "bilingual policy",
        "early learner"
      ],
      "description": "This study investigates self-perceptions of bilingual English teachers who taught English and Indonesian language at pre-schools related to the implementation of bilingual policy in for their early learners. This study is answering the research question: “What are the teacher's perceptions toward bilingual policies in teaching English for the early learner?” 12 teachers were participating in this study from 4 pre-schools in Salatiga. Their perceptions were explored using semi-structured interviews. The results show how all teachers were supportive to bilingual policy. However, when it comes to implement it, there are some struggles and differences in perception arise. Teachers with less year of experience tend to show a different perception in a negative way compared to teachers with more years in bilingual teaching experience.",
      "date": [
        "2015-03-11T08:43:17Z",
        "2015-03-11T08:43:17Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112008118",
        "14111941",
        "http://repository.uksw.edu/handle/123456789/5409"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5175",
    "datestamp": "2016-05-25T00:56:07Z",
    "metadata": {
      "title": "Students' Motivation of Learning English at Faculty of Law Satya Wacana Christian University",
      "creator": "Rettob, Sri Murni",
      "contributor": [
        "Astika, Gusti",
        "Widiningrum, Rindang"
      ],
      "subject": [
        "motivation",
        "self-determination theory",
        "learning english"
      ],
      "description": "This study attempted to provide a description of motivation that the students of college level had in learning English for a specific purpose based on Decy and Ryan's Self-determination Theory (1985). The research participants were 40 students  of Law Faculty, Satya Wacana Christian University who responded to 25 items of AMTB questionnaire (Gardner, 1985). Using descriptive method, the results revealed that generally the students had Integrative Regulation (88%) and Intrinsic Motivation (70,5%) in learning English. Therefore, they were motivated in learning English because of personal satisfaction in doing it, and for the beneficial outcome that English would enable them to get a good job and to converse with various people.",
      "date": [
        "2015-02-04T03:30:38Z",
        "2015-02-04T03:30:38Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112007220",
        "14040347",
        "http://repository.uksw.edu/handle/123456789/5175"
      ],
      "language": "id",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/12664",
    "datestamp": "2017-10-23T06:39:17Z",
    "metadata": {
      "title": "The Strategies of International Class of Management and Accounting Program (ICMAP) of Economic Faculty Students in Learning English Vocabulary",
      "creator": "Farroby, Akhmad",
      "contributor": "Isharyanti, Neny",
      "subject": [
        "Language Learning Strategy (LLS)",
        "Vocabulary Learning Strategy (VLS)",
        "and English for Specific Purpose (ESP)"
      ],
      "description": [
        "Tidak diijinkan karya tersebut diunggah ke dalam aplikasi Repositori\r\nPerpustakaan Universitas dikarenakan masih ada kekurangan administrasi.",
        "One of the challenges that learners will face during the process of second language learning is learning vocabulary. Thus, in the case of learning the vocabulary in second language, students need to be equipped with vocabulary learning strategies. Since in reading the students needto have a lot of vocabularies, learners would need to enrich vocabulary knowledge in order to read fluently. They often give up trying to understand the meaning of the text or skip reading if sentences or an entire paragraph contains a number of unknown words. These encounters suggest that some learners might not have the knowledge to handle words they do not understand. This study explores the most and the least strategy use of vocabulary learning among ICMAP students. A sample of 40 respondents participated in the study. Data collection was carried out usingquestionnaires. The findings of the data showed that the strategy most frequently used was guessing words in context.However, the least frequently used strategy was skipping the words which they do not understand. To conclude, those strategies help students acquire good vocabulary knowledge. In addition, it helps teachers in designing useful tasks and giving relevant assignments."
      ],
      "date": [
        "2017-10-23T06:38:04Z",
        "2017-10-23T06:38:04Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112010072",
        "16061487",
        "http://repository.uksw.edu/handle/123456789/12664"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5179",
    "datestamp": "2015-06-23T02:05:13Z",
    "metadata": {
      "title": "Students' Perception toward the Use of English in Teaching English for First Grade of Vocational High School of SMK Negeri 1 Salatiga",
      "creator": "Utomo, Ridwan Pasca",
      "contributor": [
        "Astika, I Gusti",
        "Pattiwael, Athriyana Santye"
      ],
      "subject": [
        "students' perception",
        "target language",
        "medium instruction",
        "teaching english"
      ],
      "description": "This paper is attempted to investigate the  students' perception about the use of the target language.  Some people believe that the use of English as the only medium instruction in the classroom is the best way to teach the students. They believe by  teaching English  using English only will make the students have better knowledge in all English aspect On  the  other hand, English is seen as a difficult material and the students have some difficulties toward this language. Based on this condition this study is aimed  at  describing  the students' perception about the use of the target language as the medium instruction in the classroom. The findings suggested that the  teacher should use English and  L1  in a certain case  in  the teaching learning process.",
      "date": [
        "2015-02-04T04:14:00Z",
        "2015-02-04T04:14:00Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112008043",
        "14040348",
        "http://repository.uksw.edu/handle/123456789/5179"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7264",
    "datestamp": "2016-06-07T02:40:08Z",
    "metadata": {
      "title": "Students’ Responses and Reactions Toward Teacher’s Written Feedback in EFL Writing Class",
      "creator": "Adi, Yohanus Fhani Purnama",
      "contributor": [
        "Husada, Hendro S.",
        "Widiningrum, Rindang"
      ],
      "subject": [
        "teacher’s written feedback",
        "type of feedback",
        "writing",
        "students’ response"
      ],
      "description": "The occurrence of teacher’s written feedback can not be avoided in writing in order to aid the students who were facing some problems composing their papers. However, there are still some arguments about how importance and how to provide a good written feedback. This study, therefore, which is replication of Alamis’ (2010), aimed to evaluate the responses and reactions that the students had about written feedback given by their teachers. The participants were 34 four students of the English Department of Satya Wacana Christian University who were enrolled in the Expository and Argumentative Writing class. The data were collected from the questionnaire. The result showed that the students agreed that feedback could help them in writing. By reading the feedback, they became aware of their weakness and strength. They also needed feedback which could motivate them to write better. The type of feedback preferred by students was the combination of telegraphic and conversational feedback. Moreover, feedback in content and organization were the areas that the participants wanted to get. At last, students preferred feedback in the form of correction; and they highly chose the direct correction which they believed could help them most in the process of writing.",
      "date": [
        "2016-06-07T02:39:32Z",
        "2016-06-07T02:39:32Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008103",
        "13030467",
        "http://repository.uksw.edu/handle/123456789/7264"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3462",
    "datestamp": "2014-01-30T03:11:00Z",
    "metadata": {
      "title": "An Analysis of English Users in Reading and Speaking Text in EFL Textbooks in Curriculum 2013 used by the First Graders of Junior and Senior High School",
      "creator": "Fajar Dewanti, Damaris",
      "contributor": [
        "Zacharias, Nugrahenny T.",
        "Rudianto, Christian"
      ],
      "subject": [
        "Inner circle",
        "Outer circle",
        "Expanding circle"
      ],
      "description": "The study was conducted to examine the representation of the main characters in EFL (English as Foreign Language) textbooks used by the first grade of Junior and Senior High School. There were two textbooks were analyzed, Bright (Zaida, 2013) and Pathway to English (Sudarwati& Grace, 2013). These books were analyzed due to the changing of the KTSP (Kurikulum Tingkat Satuan Pendidikan) into the new curriculum, curriculum 2013. The study focused on analyzing the speaking and reading text with the representation of main characters refers to Kachru (1985) categorization of Inner circle, Outer circle, and Expanding circle country. The data were analyzed quantitatively. The findings showed that the two textbooks tended to represent Indonesian main characters as English users in Expanding circle countries. Moreover, there were three categories being represented through the text such as Inner circle, Outer circle, and Expanding circle countries other than Indonesia. Several main characters from ethnic groups in Indonesia were also found in the text. One implication from the results is that if the textbooks provide a dominant role for Indonesian main characters which is part of the Expanding circle countries, teacher can try to add some additional materials about the users of English in Outer circle countries. So that the students might understand that English users are not limited to the Inner circle Countries (Matsuda, 2002).",
      "date": [
        "2014-01-30T03:00:07Z",
        "2014-01-30T03:00:07Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008065",
        "13080681",
        "http://repository.uksw.edu/handle/123456789/3462"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5485",
    "datestamp": "2015-03-17T04:43:39Z",
    "metadata": {
      "title": "Female Register in CMC",
      "creator": "Awondatu, Aditya Andreani",
      "contributor": [
        "Toar, Dian",
        "Isharyanti, Neny"
      ],
      "subject": [
        "Female Register",
        "CMC",
        "CMD"
      ],
      "description": "Lakoff  (1973) stated  that in Face-to-Face  (F2F)  interaction,  females possess  certain registers  in their language use.  Some experts  also  give  supporting information  about  it; one of them is Harmer (2001)  who states  that  men and women do communicate differently.  Along with the development of technology, nowadays  people  do  not only communicate  in F2F,  but  the  communication also takes  place in  Internet.  According to Higgins (1991),  communication which occurs  in the  Internet  is  known as Computer-Mediated Communication (CMC).This study was conducted to find out if female register occurred in CMC.  As language is dynamic and studies suggest that CMC has different features from F2F, this  research  was aimed at identifying the female use of language in CMC environment using Lakoff (1973) framework of  Female Register  and based on Herring?s (2007) context of online discourse, known as  Computer-Mediated Discourse (CMD).  In attempting to accomplish  the objective, 5 female students  of English Language Education Department from the Faculty of Language and Literature, Satya Wacana Christian University, Salatiga  participated and the analysis  was based on their conversation  in Facebook Message. The data was analyzed and elaborated qualitatively. The results  indicated that not all characteristics of  Female Register  found in the  conversations.  There  were only five  characteristics used by the participants;  the use of Hedges, the use of word „So?,the use of Empty Adjectives, the use of Tag Questions, and the use of Polite Language. The status of the participants as Non-Native English speakers might bethe  main reason why  not all characteristics found. Although not all characteristics found, it can be concluded that Female Register also occurs in CMC.",
      "date": [
        "2015-03-17T04:43:06Z",
        "2015-03-17T04:43:06Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112010097",
        "14110847",
        "http://repository.uksw.edu/handle/123456789/5485"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/10676",
    "datestamp": "2017-04-03T01:19:49Z",
    "metadata": {
      "title": "Teachers' QUuestins in English Lesson in SMA N 1 Salatiga",
      "creator": "Anisa, Kusmiyani Desi",
      "contributor": [
        "S, Maria Christina Eko",
        "Sumakul, Dian Toal Y.G"
      ],
      "subject": "Bahasa dan Sastra",
      "description": "Question and answer are the most common ways of interactions in classrooms' activities. By asking questions, teachers can build good communications with the students, review the materials, assess the students' abilities and aasist them to comprehend the lessons. Sinces questions frequently produce by the teachers and have a significant role in learning, i am interested to do a research in the that field. The study is conducted to examine the types of questions used in English lesson especially in senior High School Negri 1 Salatiga. The participants are four teachers, each of them was observed twice. The data are collected using observations. The study revealed that the teachers used the eight types of teachers' questions, they are Yes-No, Short-Answer, Display, Corvergent, Open-Ended, Referential, and Imaginative Question. The study also revealed that Yes-No questions is the teaching-learningprocess. study is expected to aid the student-teachers applying the suitable questions while teaching.",
      "date": [
        "2017-04-03T01:18:13Z",
        "2017-04-03T01:18:13Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112011112",
        "16020500",
        "http://repository.uksw.edu/handle/123456789/10676"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9458",
    "datestamp": "2017-01-25T09:26:09Z",
    "metadata": {
      "title": "Stereotyping in Gung Ho Movie: an appraisal analysis",
      "creator": "Adelia, Winda",
      "contributor": [
        "Sumakul, Dian Toar Y.G.",
        "Isharyanti, Neny"
      ],
      "subject": [
        "appraisal analysis",
        "stereotyping threat",
        "effective communication",
        "Gung Ho Movie",
        "interpersonal analysis"
      ],
      "description": "Many people do communication without comprehending the meaning contained in the sentences. The need to understand the meaning of the sentences of stereotyping threat by Appraisal analysis could make people become more aware with their sentences. Appraisal analysis, an approach by Thompson (2004) is a method to analyze stereotyping threat sentences. The sentences are divided into Appraisal sub-categories: Affect, Judgement and Appreciation. This study was conducted to find out the stereotyping in Gung Ho movie. This movie is considered as one that is rich with stereotyping according to the audience. With the help of functional grammar perspective, the analysis could be more reliable. Using Appraisal Analysis, there were 15 sentences found to have stereotyping. From those 15 sentences, there were 7 sentences of Affect and 8 sentences of Judgement. There was no sentence of Appreciation. The data indicated that the most of stereotyping threat sentences were Judgement.",
      "date": [
        "2017-01-25T09:25:34Z",
        "2017-01-25T09:25:34Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112012014",
        "16062042",
        "http://repository.uksw.edu/handle/123456789/9458"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3493",
    "datestamp": "2014-02-03T07:15:39Z",
    "metadata": {
      "title": "Student's Silence Experience on EFL Classroom: Factors and Solutions",
      "creator": "Wiratama Pranasti, Bintang",
      "contributor": [
        "Kurniawati, Anita",
        "Tri Ragawanti, Debora"
      ],
      "subject": [
        "student’s silence",
        "classroom participation",
        "student’s effort"
      ],
      "description": "This study is aimed at investigating factors that influence student's silence and also finding out student's effort to overcome silence. There were 100 students who enrolled BIP 4 class of Faculty of Information Technology (FIT), Satya Wacana Christian University (SWCU) who participated in filling close-ended and open-ended questionnaires. In discovering factors of silence, this study analyzed qualitatively as well as quantitatively so that finally the results of the study found that there are four major factors that influence the students to keep silent in the classroom. The four factors are student's English proficiency, fear of making mistake, teacher methodology, and also alleged with anxiety. Furthermore, this study also discovered that taking an active part of the discussion is the most beneficial effort of the students to overcome silence so that they can increase their participation rate in the classroom. This study is useful for the teachers to create a good atmosphere in the classroom as well as reducing silent behavior in classroom.",
      "date": [
        "2014-02-03T07:12:41Z",
        "2014-02-03T07:12:41Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008149",
        "13070822",
        "http://repository.uksw.edu/handle/123456789/3493"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9494",
    "datestamp": "2017-01-26T08:04:06Z",
    "metadata": {
      "title": "Teachers’ Strategies in Dealing with Students’ Various Learning Styles",
      "creator": "Evangelista, Victoria",
      "contributor": [
        "Mambu, Joseph Ernest",
        "Setyarini, Maria Christina Eko"
      ],
      "subject": [
        "strategies",
        "learning styles"
      ],
      "description": "There will always be a possibility that a mismatch may occur between students’ learning styles and their teachers’ teaching style. This mismatch commonly results in students’ lack of understanding and motivation in learning the target language. Therefore, teachers’ strategies are needed to overcome this problem. This study aims to investigate teachers’ strategies in dealing with students’ various learning styles in English classes of several senior high schools in Salatiga. 12 English teachers from six different senior high schools; three private schools and three public schools, were interviewed. The results of the interviews were classified based on three strategies which derived from Bacay’s (2006) study: (1) requiring the students to adjust to teachers’ teaching style (more teacher-centered); (2) adjusting to students learning styles (more learner-centered); and (3) balancing between numbers 1 & 2. In general, there are two main factors that may influence a teacher to use a certain strategy—what I refer to as internal and external factors. The former includes teachers’ beliefs about effective teaching, their power, or their students’ needs. Whereas, the latter, may include limited time, government policy, materials or topics of the lesson, and most probably the average amount of students they teach in one class. It was found that the strategy mostly used was the third strategy, the second was the first strategy, and the least used was the second strategy due to the factors mentioned above.",
      "date": [
        "2017-01-26T08:03:35Z",
        "2017-01-26T08:03:35Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112012047",
        "16062061",
        "http://repository.uksw.edu/handle/123456789/9494"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9412",
    "datestamp": "2022-02-10T07:29:27Z",
    "metadata": {
      "title": "Students’ Perceptions About The Teacher’s Use of First Language in Basic Grammar Course",
      "creator": "Andreas, Matias Eddo",
      "contributor": [
        "Murtisari, Elisabet Titik",
        "Palupi, Vitorica Usdaya"
      ],
      "subject": [
        "first language",
        "perceptions",
        "basic grammar",
        "perspective"
      ],
      "description": "This research aims to analyze students’ perceptions about the use of first language in basic grammar course. I will also find students’ opinion about teacher’s use of English in basic grammar class. There will be one research question that will be discussed in this research that is ‘What are the students’ perspectives toward the use of First Language (Indonesian) in basic grammar course?’ This paper would be based on some theories from the people that expert in these theories, like Krashen (1985), Ellis (2005), etc. The participants in this research are the students of 2014 of English Department who had just taken the basic grammar course this year at Satya Wacana Christian University, Salatiga. Questionnaire will be used in this research. This research showed about their opinion about their motivation in learning basic grammar class using Indonesian, their thoughts about teachers that teach using Indonesian in basic grammar course and advantages or disadvantages for the students about the use of Indonesian itself. As the result, the students need to use English more than Indonesian in the class.",
      "date": [
        "2017-01-25T02:21:11Z",
        "2017-01-25T02:21:11Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112011006",
        "16061364",
        "http://repository.uksw.edu/handle/123456789/9412"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7299",
    "datestamp": "2016-06-08T06:50:39Z",
    "metadata": {
      "title": "Students' Preferences of Areas to Give Feedback During Peer Assessment in Academic Writing Class",
      "creator": "Sumihe, Paideia Gratia",
      "contributor": [
        "Listyani",
        "Rudianto, Christian"
      ],
      "subject": [
        "peer assessment",
        "written feedback"
      ],
      "description": "A large area of research has examined the effectiveness of the role of peer assessment in the writing instruction in ESL context. However, it seemed to be lack of knowledge about students' preferences of feedback area in peer assessment. This study investigated the students' preference of areas to be given feedback in peer assessment in Academic writing class and also the reasons for their preference. Quantitative and qualitative data were collected from 70 Academic writing students through written questionnaires. The finding of the study revealed that content was the most favored area to be given feedback in writing rather than style and structure feedback. Leaners proficiency, easiness of finding the errors and students' belief of the importance of feedback areas were several reasons which determined the feedback area being given to one's writing that should be taken into account.",
      "date": [
        "2016-06-08T06:50:08Z",
        "2016-06-08T06:50:08Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112009080",
        "13070758",
        "http://repository.uksw.edu/handle/123456789/7299"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7263",
    "datestamp": "2016-06-07T02:33:49Z",
    "metadata": {
      "title": "The Hegemony of Patriarchal Society as Shown in Ahmad Tohari’s Ronggeng Dukuh Paruk",
      "creator": "Kristiana, Yosia",
      "contributor": [
        "Kristono, Lany",
        "Rudianto, Christian"
      ],
      "subject": [
        "patriarchal society",
        "ronggeng",
        "traditions",
        "values"
      ],
      "description": "As the title states, the hegemony of patriarchal society is portrayed in Ahmad Tohari “Ronggeng Dukuh Paruk”. Written in 1982, Ronggeng Dukuh Paruk depicts events taking place in Banyumas, Central Java. In collectivism societies such as in Banyumas, every person is expected to follow the values and rules of that area but the protagonist character in Ronggeng Dukuh Paruk (Srintil) did not obey it. As a ronggeng dancer, she was expected to preserve the rules, values, and traditions of her society, but she did not. This leads to the question of how the protagonist of Ronggeng Dukuh Paruk fought against the patriarchal society and if she was really able to liberate herself from the patriarchal society’s domination. Patriarchy concept is relevant to be applied in this discussion. It is because the story takes place in the patriarchal society. The analysis revealed that Srintil’s struggle against the patriarchal society was not completely successful because she was trapped again in the patriarchal values. It is because she finally desired to be a good wife of Bajus, who treated her respectfully and helped her financially.",
      "date": [
        "2016-06-07T02:33:17Z",
        "2016-06-07T02:33:17Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008102",
        "13030427",
        "http://repository.uksw.edu/handle/123456789/7263"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5998",
    "datestamp": "2015-06-03T09:50:17Z",
    "metadata": {
      "title": "Using Vocabulary Notebook to Develop Students’ Vocabulary in SMP Kanisius Girisonta",
      "creator": "Susilowati, Dewi",
      "contributor": [
        "Astika, Gusti",
        "Maria L.A.F., Suzana"
      ],
      "subject": [
        "learning strategies",
        "teaching technique",
        "vocabulary",
        "vocabulary notebook"
      ],
      "description": "This study attempted to answer the research question “What are the students’ responses towards using vocabulary as a teaching technique  to develop vocabulary?” Prior the data collection, five students  from SMP Kanisius Girisonta Ungaran were taught and asked to make and learn new words/difficult words by means of vocabulary notebook strategy for approximately 3 months. The analysis showed  that the students had positive responses about learning vocabulary using notebook.  The students  reported that they liked the vocabulary strategy by using vocabulary notebook  since  it helped them to learn new words easily and quickly.  Moreover, the students view  that  the  strategy made them to become autonomous learners than before (without using vocabulary notebook)",
      "date": [
        "2015-06-03T09:48:39Z",
        "2015-06-03T09:48:39Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112007097",
        "13030454",
        "http://repository.uksw.edu/handle/123456789/5998"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5380",
    "datestamp": "2015-03-10T02:39:14Z",
    "metadata": {}
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5403",
    "datestamp": "2015-03-10T08:39:49Z",
    "metadata": {
      "title": "Students' Attitudes toward the Use of Authentic Materials in SMPN 2 Ampel",
      "creator": "Sasongko, Purnomo Adi",
      "contributor": "Timotius, Anne Indrayanti",
      "subject": "Authentic Material",
      "description": "The use of authentic material is now developing rapidly. It becomes more popular and widely used, because it is believed that using authentic material to teach English offers more benefits than using non-authentic materials or contrived (textbook). The use of authentic materials are also controversial instead of offering benefits it also believed that authentic materials had its disadvantages, This study aimed to investigate and describe the students' attitude toward the use of authentic materials in teaching reading in SMPN 2 Ampel. The subject of this study involved a group of students, which consists of 2 classrooms at same level or same grade that was eight grade of junior high school, which included 63 students who were taking English class. This study used a descriptive method. Data were collected by teaching students English subject inside the classroom activity using authentic materials. Then, data were collected through questionnaire by some adaptations from Peacock (1997), Rosalina (2006) and Bagus (2011). After that, writer presented the data by using tables and charts. Then, the data was analyzed and described. The result of the study generally showed that the students had positive attitude toward the use of authentic material in reading English subject.",
      "date": [
        "2015-03-10T08:39:49Z",
        "2015-03-10T08:39:49Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112007164",
        "14111814",
        "http://repository.uksw.edu/handle/123456789/5403"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7301",
    "datestamp": "2016-06-08T08:57:38Z",
    "metadata": {
      "title": "Students' Perceptions Toward Native and Non Native English Teachers in English Department of Satya Wacana Christian University",
      "creator": "Utami, Nurul",
      "contributor": [
        "Astika, Gusti",
        "Santoso, Petrus Ari"
      ],
      "subject": [
        "native-speaker teachers (NS)",
        "non-native speaker teachers (NNS)",
        "students' perception"
      ],
      "description": "While the majority of English teachers in ELT are non native English teachers, there is a controversial issue that the best teacher of English is a native speaker with the belief in the superiority in language proficiency and competency. More specifically, a total number of non native English teachers are greater than native English teachers in EFL context. This study examined students' perceptions towards native and non native English teachers in English Department of Satya Wacana University. The findings revealed  favorable perception towards both native and non native English teachers. Overall the  students did not show significant preferences that favored native English teachers over  non native English teachers regarding the five aspects of language teaching: (1) competence  in the target language, (2) competence in teaching language skill, (3) cultural aspects,  (4) personal aspects, and (5) classroom atmosphere. Despite of that, they realized that  both native and non native English teachers had their own strengths even in equal proportion.",
      "date": [
        "2016-06-08T08:56:03Z",
        "2016-06-08T08:56:03Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112009088",
        "13070881",
        "http://repository.uksw.edu/handle/123456789/7301"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5489",
    "datestamp": "2015-03-17T06:23:58Z",
    "metadata": {
      "title": "Teachers' Perspective on the Use of Games in English Teaching and Learning Process: A Study at Bethany Elementary School",
      "creator": "Kristanti, Dessy",
      "contributor": "Ragawanti, Debora Tri",
      "subject": [
        "teachers’ perception",
        "games",
        "teaching English"
      ],
      "description": "Recently, games are widly used by teachers in teaching and learning process since games are one of the important tools in EFL as stated by McCallum (1980) and Mubaslat (2012). Through this study, the writer investigated the teachers‟ perception toward the use of games in teaching English for young learners and types of games used by the teachers. This study was conducted in the first and the second grade of Bethany Elementary School Salatiga, with two participants of English teachers. Observation and interviews were used as instruments of data collection. The findings show that there were six types of games, which are Order; Connect: compare, match, group; Do: move, mime, draw, obey; Remember; Identify: discriminate, guess, speculate and Create found used by the teachers. In addition, the findings also indicate that teachers have positive perception towards games, since they can contribute to improve the students‟ language skills, build their grammar understanding, engage the students to learn the lesson, help them to expand their vocabulary and help the teachers to see the students‟ actual ability. However, the observed teachers also view that games can be boring and time consuming. Games are also demanding in terms of background knowledge and giving difficulty for the teachers to control the classroom management. Therefore, the observed teachers gave some sugggestion to minimize the problems.",
      "date": [
        "2015-03-17T06:23:23Z",
        "2015-03-17T06:23:23Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112010111",
        "14111752",
        "http://repository.uksw.edu/handle/123456789/5489"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5207",
    "datestamp": "2016-05-25T02:15:12Z",
    "metadata": {
      "title": "Common Grammatical Errors Made by ED Students in Guided Writing Class",
      "creator": "Shertian, Rowena Rayi",
      "contributor": [
        "Sari, Sesilia Rani Setyo",
        "Sumakul, Dian Toar Y.G."
      ],
      "subject": [
        "grammatical errors",
        "error analysis",
        "syntax errors",
        "morphology errors"
      ],
      "description": "The study focused on what common  grammatical errors  are  made by ED students in Guided writing class. This study was conducted to analyze what  grammatical errors  are. The writer uncovered common grammatical errors made by ED Students in Guided Writing class, therefore, the data instrument  that  the writer  used are collecting the students' work in quantitative way. The research  question  what are common grammatical errors made by ED students in Guided writing class showed the finding that most of the participant made syntax errors. The percentage is 75 %.  12% of the participants made  morphology errors  and 13% of them did not make  error.  This study suggests the participant that they should give more attention to English  grammar. Therefore, the common grammatical errors can be anticipated. The writer suggests for other researcher that more participants should be taken as sample so that the data could be more valid.",
      "date": [
        "2015-02-06T03:48:08Z",
        "2015-02-06T03:48:08Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "14040314",
        "112009124",
        "http://repository.uksw.edu/handle/123456789/5207"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/10582",
    "datestamp": "2017-03-30T01:53:54Z",
    "metadata": {
      "title": "Foreign Language Anxiety in Transactional Speaking Class",
      "creator": "Christine, Victoria",
      "contributor": "Widiningrum, Rindang",
      "subject": [
        "foreign language anxiety",
        "speaking class",
        "EFL learners",
        "FLCAS",
        "language learning"
      ],
      "description": "Foreign Language Anxiety in Transactional Speaking Class This study aimed  to find kinds of anxiety  experienced by EFL (English as Foreign Language) learners in Transactional Speaking class. Several researches (Horwitz et al. (1986); Dörnyei (2001); and Littlewood (1998)) propose that anxiety can impede the students’ learning processes. Therefore, it is important find kinds of anxiety which the participants are  experiencing.  This study examined  56 first year students of  English Literature Program of  Faculty of Language and Literature in Satya Wacana Christian University who are taking Transactional Speaking class.  A 16-item questionnaire adapted from Foreign Language Classroom Anxiety Scale and semi-structured interview were used as data collection instruments.  The data shows that the participants experienced  the three kinds of anxiety, Test Anxiety, Communication Apprehension, and Fear of Negative Evaluation. The three kinds of anxiety used in this study are based on Horwitz, Horwitz, & Cope (1986). The discussion shows that their anxiety could be affected by many reasons. It is hoped that by considering various kinds of anxiety and its reasons,  teachers can get a better insight in motivating their students who are anxious.",
      "date": [
        "2017-03-30T01:53:28Z",
        "2017-03-30T01:53:28Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112011059",
        "16020476",
        "http://repository.uksw.edu/handle/123456789/10582"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5431",
    "datestamp": "2015-03-12T07:39:28Z",
    "metadata": {
      "title": "Binary Opposition on the Role of Woman as Depicted in the Interpreter of Maladies",
      "creator": "Andaru, Valentina Laras Gita",
      "contributor": [
        "Danelson, Danielle",
        "Kusumaningtyas, Purwanti"
      ],
      "subject": [
        "Interpreter of Maladies",
        "binary opposition role on women",
        "Gilbert and Gubar"
      ],
      "description": "Living in this patriarchal world may bring some disadvantages to women. One of the example is bring women down to size by giving them limited role in literary works. Examining “Interpreter of Maladies” by Jhumpa Lahiri, I will analyze how the main character, Mrs. Das, limited in her role. This paper attemps to reveal how women's role limited in literary works by embracing the theory of binary opposition role by Gilbert and Gubar. It will explain how women are portrayed either as an angel or a monster (3). In its conclusion, this paper will show that Mrs. Das' character is limited through binary opposition role in the story of “Interpreter of Maladies”.",
      "date": [
        "2015-03-12T07:37:01Z",
        "2015-03-12T07:37:01Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112010010",
        "14110838",
        "http://repository.uksw.edu/handle/123456789/5431"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/12663",
    "datestamp": "2017-10-23T06:33:56Z",
    "metadata": {
      "title": "Popular Culture Analysis: Hidden Motives of Rebecca’s Consumerist Behaviour as Shown in The Movie Confession of A Shopaholic",
      "creator": "The, Melania Ariyanto",
      "contributor": "Sriastuti, Anna",
      "subject": [
        "needs theory",
        "house of pop culture",
        "consumerism culture"
      ],
      "description": "As human being we live in a society that confines our perspective and behaviour. The society lives in the world where consuming things is one of the most important things in life. People believe that being a consumerist is somehow a culture. However, people are not aware of the motives that make them a consumerist. They keep consuming without actually knowing the reason why. The movie Confession of a Shopaholic is a perfect embodiment of the consumerism issue. The main character, Rebecca shows how she is trapped in consumerism. The purpose of this study is to find the hidden motives of the main character that turns her into a shopaholic. In order to do that the writer will analyse the needs of the main character to understand the reason that makes her a consumer. Then, the writer will analyse the consumerism culture to know the environment the support her to be a consumerist. After that, the writer will analyse the hidden motives using house of popular culture. The result is that she needs to be accepted and respected by the society, as they judge people by their cover.",
      "date": [
        "2017-10-23T06:31:52Z",
        "2017-10-23T06:31:52Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112010031",
        "16061567",
        "http://repository.uksw.edu/handle/123456789/12663"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9522",
    "datestamp": "2017-01-27T01:06:14Z",
    "metadata": {
      "title": "The Transitivity-Passivization Interface in Two Online Newspapers about The Israeli-Palestinian Conflict",
      "creator": "Joharta, Edwin Bagus",
      "contributor": [
        "Mambu, Joseph Ernest",
        "Sumakul, Dian Toar Y.G."
      ],
      "subject": [
        "critical discourse analysis",
        "Israel",
        "Palestine",
        "transitivity",
        "passivization"
      ],
      "description": "Mass media are often biased in reporting certain news. There will always be reason on why they report certain news besides the commercial benefit they will get. This phenomenon requires readers to be more aware and critical when getting information from the media. By using critical discourse analysis, this study attempts to draw comparison between two different newspapers to find how newspapers convey meaning through the news reporting. There are two tools of critical discourse analysis that will be used to conduct this analysis. They are the transitivity analysis on participants and processes, and passivization technique that is used by the newspapers. The news articles are the online edition taken from the Antara News, an Indonesian newspaper and the New York Post, an American newspaper. Both newspapers report the conflict of Israeli and Palestinian in the Third Gaza War in 2014. The result is interesting in that both newspapers emphasize different points about the conflict even though the event of the news is the same. How the newspapers use the choice of verbs, the sources to support information, and the words construction in reporting the events implicitly tell how newspapers position themselves in the issue.",
      "date": [
        "2017-01-27T01:05:44Z",
        "2017-01-27T01:05:44Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112012114",
        "16063286",
        "http://repository.uksw.edu/handle/123456789/9522"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/10599",
    "datestamp": "2022-02-10T07:20:22Z",
    "metadata": {
      "title": "The Translation of English Actives into Indonesian in News Texts",
      "creator": "Christy, Theodora Amy",
      "contributor": "Murtisari, Elisabet Titik",
      "subject": [
        "translation",
        "language contact",
        "language shift",
        "grammatical equivalence",
        "active and passive forms"
      ],
      "description": "At present, English has  an  indispensable preeminence because of its position as  a  lingua franca or  an  international language.  With the large bulk of information delivered in English, especially news, there is a pressing necessity for  Indonesian  to translate.  However, English, as the source language in English  –  Indonesian transfer seems  to influence the Indonesian translation particularly in its structure.  Although many studies  have addressed  about the  hegemony  of English in Indonesian,  there is no study that discusses deeply about the change of Indonesian passive into active forms in translation.  Therefore, this study attempts to find  how the English active forms  are  translated into Indonesian  in the terms of the grammatical norms of the target language. The findings of this study show that  the translators almost always translate an  English active form into an Indonesian active form  instead of  an Indonesian passive form.",
      "date": [
        "2017-03-30T02:32:54Z",
        "2017-03-30T02:32:54Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "112011094",
        "16020491",
        "http://repository.uksw.edu/handle/123456789/10599"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/1104",
    "datestamp": "2012-12-06T08:49:07Z",
    "metadata": {
      "title": "An Analysis of Code Switching and Code Mixing Spoken by Five Socialite Women in “Arisan Brondong” Movie",
      "creator": "Permana, Anggera Krista",
      "contributor": [
        "Rudianto, Christian",
        "Eko S, Maria Christina"
      ],
      "subject": [
        "Code-Switching",
        "Code-Mixing",
        "Socialite Women",
        "Brondong",
        "Prestige"
      ],
      "description": "This study focuses on an analysis of the occurrences code switching and code-mixing in the script of “Arisan Brondong” movie. This movie gives a glimpse of the upper class lifestyle represented by the socialite women in Indonesia. One of the indications of upper class group is the language use. Thus, it is interesting to see the language spoken by socialite women in the movie. Related to this, the study aims at finding out: 1) the most frequent types of code switching and code-mixing occurring in the script by 5 socialite women; and 2) with whom were socialite women talking to. The data were collected from a script of “Arisan Brondong” movie. Occurrences found in the script were identified by employing Wardhaugh's theories in 2001: metaphorical switching and situational switching and Muysken's theories in 2000 on types of code-mixing: insertion, alternation and congruent lexicalization. The study showed insertion of code-mixing and situational switching of code switching as the most frequent types occurring in the dialogue of 5 socialite women. The study also showed the occurrences of code switching mostly occur between the socialite women and “Brondong”, while on code mixing mostly occur among socialite women. In general, the findings of the study point to the language as the style of socialite women to show their prestige",
      "date": [
        "2012-12-06T08:48:29Z",
        "2012-12-06T08:48:29Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "112007031",
        "12060340",
        "http://repository.uksw.edu/handle/123456789/1104"
      ],
      "language": "en",
      "format": "application/pdf",
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3402",
    "datestamp": "2014-01-28T03:22:48Z",
    "metadata": {
      "title": "Identification Of Six  Elements Of Narrative Used By Third Grade Of Elementary School Students Of Bethany School In Rewriting The Story Of  Rawa Pening",
      "creator": "Sahputra Sihombing, Ronny",
      "contributor": [
        "Usadya Palupi, Victoria",
        "Tri Ragawanti, Debora"
      ],
      "subject": [
        "six elements of narrative",
        "weakness"
      ],
      "description": "This study aims to investigate the use of six elements of narrative (setting, atmosphere, plot, conflict, characters, and theme) in rewriting the story of Rawa Pening. The participants consisted of 13 students of third grade of an elementary school students in Salatiga offered in first semester, 2011-2012 academic year. The result show that the use of six elements of narrative still the weakness for third grade students and need to be improved.",
      "date": [
        "2014-01-28T03:20:34Z",
        "2014-01-28T03:20:34Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112007205",
        "13070815",
        "http://repository.uksw.edu/handle/123456789/3402"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7295",
    "datestamp": "2016-06-08T04:35:24Z",
    "metadata": {
      "title": "Students' Acquisition of Negative Constructions in the Present Tense",
      "creator": "Sulistyowati, Garnis Dwi",
      "contributor": [
        "Astika, Gusti",
        "Nandari, Martha"
      ],
      "subject": [
        "negative constructions",
        "students' perception",
        "morphological errors",
        "syntactic errors",
        "mechanical errors"
      ],
      "description": "This study aimed to describe the students' witing problems of negative constructions in the Present Tense. This study was conducted in a rural school, SMP Negei 2 Tuntang. The research participants were thirty four students in that school. The data were collected using a test. The students changed ten positive statements into negative statements in the Present Tense. This study found three common writing problems of negative constructions in the Present Tense. They were morphological error, syntactic error, and mechanical error.",
      "date": [
        "2016-06-08T04:34:23Z",
        "2016-06-08T04:34:23Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112009068",
        "13070787",
        "http://repository.uksw.edu/handle/123456789/7295"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7288",
    "datestamp": "2016-06-08T00:43:58Z",
    "metadata": {
      "title": "The Use of Sesame Street Program to Develop Pronunciation for Primary Students",
      "creator": "Wijayanti, Maria Eka",
      "contributor": [
        "Astika, Gusti",
        "Sari, Sesilia Rani Setyo"
      ],
      "subject": [
        "sesame street video",
        "pronunciation",
        "primary students"
      ],
      "description": "The focus of this study is to find out whether Sesame Street video helped children to develop their pronunciation in English. In this study, a descriptive method was used to study the pronunciation development of seven primary students. The students were asked to watch Sesame Street video several times, and then their voice was recorded as they were reading the script. The average scores of correct pronunciation in each treatment were made into a line graph to show the pronunciation development. It was found that the average score increased 35% from pre-test to test 5. The findings show that the more students watch and listen  to the video, the better their pronunciation was. This study could be very useful to teachers in teaching pronunciation to primary school students and to students to gain better English pronunciation by using Sesame Street video.",
      "date": [
        "2016-06-08T00:43:35Z",
        "2016-06-08T00:43:35Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112009049",
        "13070832",
        "http://repository.uksw.edu/handle/123456789/7288"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/9404",
    "datestamp": "2017-01-25T01:43:10Z",
    "metadata": {
      "title": "Analysis of The Raid: redemption movie subtitling strategy",
      "creator": "Fajaressa, Restu",
      "contributor": [
        "Murtisari, Elisabet Titik",
        "Kendenan, Esriaty  S."
      ],
      "subject": [
        "subtitling",
        "strategy",
        "movie",
        "inter-lingual translation"
      ],
      "description": "This study was an attempt to identify the inter-lingual translation strategies in Indonesian to English movie subtitling and determine the frequency of each. Things that researcher has considered towards this study were (1) Subtitling strategy that used by subtitler on The Raid: Redemption movie. (2) What strategy mostly used by subtitler to transfer the language on The Raid: Redemption movie. This is a comparative study, the researcher compared both the subjects and identified strategy used in every line. This study mainly focused on subtitling strategy. The subjects of this study were original text of The Raid: Redemption movie and the English subtitle. Researcher used subtitling strategy by Gottlieb (1998), and came up with conclusion that Transfer strategy is used the most in subtitling the movie with the frequency of 371 out of 520.",
      "date": [
        "2017-01-25T01:41:13Z",
        "2017-01-25T01:41:13Z",
        "2016"
      ],
      "type": "Thesis",
      "identifier": [
        "112010113",
        "16063328",
        "http://repository.uksw.edu/handle/123456789/9404"
      ],
      "language": "en_US",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/1910",
    "datestamp": "2013-04-12T07:59:50Z",
    "metadata": {
      "title": "An Analysis of The Ed Students' Perception on the Conflict Between Javanese and Western Mysticism Concept",
      "creator": "Setianda, Aulfiando",
      "contributor": [
        "Donelson-Sims, Danielle",
        "Rudianto, Christian"
      ],
      "description": [
        "Lembar Pengesahan tidak disertai tanda tangan dosen pembimbing",
        "Mysticism might be just considered as an illusion for some people, but it does exist in our life. Basically, mysticism in general was aimed as a medium to communicate with God, but in today's reality it is growing differently from the main purpose and has become a dark mysticism. This study attempts to find out the mindset of ED students about mysticism; does the knowledge about western culture they got in ED influence their insight about mysticism. The study used the movie “Amity Ville Horror” as the representative of western mysticism and three students each from 2006 and 2010 as the participants. The different entering years here aimed to represent the longer and shorter exposure to western culture especially through some academic experiences though it is not the only factor that might influence one's mindsets. The analysis of the data shows that most of the subjects believe in mysticism and the Javanese concept of mysticism is not influenced by the knowledge they got in ED."
      ],
      "date": [
        "2013-04-12T07:53:52Z",
        "2013-04-12T07:53:52Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "12070903",
        "112004167",
        "http://repository.uksw.edu/handle/123456789/1910"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7257",
    "datestamp": "2016-06-03T08:45:32Z",
    "metadata": {
      "title": "A Study of Vocabulary Learning Strategies Used by Faculty of Information Technology  Students",
      "creator": "Kristy, Hanindha Sabatta",
      "contributor": [
        "Astika, Gusti",
        "Sari, Sesilia Rani Setyo"
      ],
      "subject": [
        "vocabulary learning strategies",
        "non-English major",
        "Schmitt’s classification"
      ],
      "description": "This paper investigated the use of strategies by non-English major students in their vocabulary learning. The participants of this study were 92 students from Faculty of Information Technology of Satya Wacana Christian University. The data were analyzed based on Schmitt's vocabulary learning strategy classifications, which are determination, social, cognitive, memory, and metacognitive strategies.  The result for descriptive statistics of this study showed that determination strategies were used most frequently and social strategies were used least frequently. The result related to specific analysis of each strategy revealed that most of the participants commonly enriched their vocabulary through English media. Additionally, this study also discovered using new vocabularies in writing journal, note or report are strategies least commonly used by participants. Considerably more work will need to done by conducting a further class observation and interview in order to gain deeper analysis of the vocabulary learning strategies used.",
      "date": [
        "2016-06-03T08:45:32Z",
        "2016-06-03T08:45:32Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008094",
        "13030464",
        "http://repository.uksw.edu/handle/123456789/7257"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/17855",
    "datestamp": "2022-03-16T01:49:41Z",
    "metadata": {
      "title": "Students’ Perceptions of Group-LED Workshop Project in Current Issues in Applied Linguistics Class",
      "creator": "Maulidia, Rindang",
      "contributor": "Mali, Yustinus Calvin Gai",
      "subject": "perceptions and project-based learning",
      "description": "The practice of PBL in classrooms has been explored involving several aspects. However, there are limitations in examining PBL practice in EFL classroom from students’ point of view. Thus, this study was conducted to reveal the use of PBL in an EFL Classroom in a private university in Central Java, Indonesia, from the students’ point of view. The research was conducted in the third semester of the 2017/2018 academic year. The researcher gathered the students’ perceptions of the use of PBL in Current Issues in Applied Lingusitics (CIApL) classrooms through direct interviews with 10 students from different groups. During the CIApL course, students needed to work in a small group and lead a workshop called Group-Led Workshop (GLW). Thematic analysis was used to interpret the data. Moreover, the results were divided into two big themes, namely working with supportive group members and learning opportunities gained form the group workshop. The main findings revealed that project based learning, in this case, through the GLW, could enhance the positive learning environment since it can activate students’ sense to compete and collaborate positively with others through the group work by preparing the workshop well. In addition, it can also play a role as an excellent approach to learn from peer feedback as it appeared to be a positive movement.",
      "date": [
        "2019-09-11T01:43:53Z",
        "2019-09-11T01:43:53Z",
        "2018"
      ],
      "type": "Thesis",
      "identifier": [
        "112014020",
        "18100210",
        "http://repository.uksw.edu/handle/123456789/17855"
      ],
      "language": "id",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5494",
    "datestamp": "2015-03-17T07:07:12Z",
    "metadata": {
      "title": "Investigating Students' Writing Anxiety: A Study at English Teacher Education of Satya Wacana Christian University",
      "creator": "Tuppang, Karmi Serewara",
      "contributor": [
        "Ragawanti, Debora Tri",
        "Widiningrum, Rindang"
      ],
      "subject": [
        "EFL",
        "writing",
        "type of writing anxiety",
        "factors cause the students felt anxious"
      ],
      "description": "As a foreign language, English often made English Teacher Education  of Satya Wacana Christian University  students felt worried. Especially in writing,  the students have to pay attention to some things when they were writing in English such as grammar, content, etc.  In doing the practice of writing, learners are very possible to face problems such as anxiety.  The purposes of this study  are  to find out what type of writing anxiety experienced by  English Teacher Education of Satya Wacana Christian University students and to investigate what extent the students experience a particular type of writing anxiety. The data was obtained  by distributing 56 close-ended questionnaires and  by doing interview to  15  participants. The result shows  that Cognitive Anxiety is the most common type of writing anxiety experienced by the students. In addition, this study also found some factors that  cause  the students felt anxious, such as the  perception from teacher  and classmates,  writing class that they have never experienced before, writing skills  are lacking, the pressure from the teacher, writing under time constraint, and  the writing teacher who really focuses on grammar.",
      "date": [
        "2015-03-17T07:04:01Z",
        "2015-03-17T07:04:01Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112010131",
        "14110803",
        "http://repository.uksw.edu/handle/123456789/5494"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/1935",
    "datestamp": "2013-04-15T06:45:21Z",
    "metadata": {
      "title": "Teachers' Perception Toward The Use of English as a Medium Instruction at Some Private Elementary Schools in Salatiga and Semarang",
      "creator": "Indriani, Rosalina",
      "contributor": [
        "Zacharias, Nugrahenny T.",
        "Usadya Palupi, Victoria"
      ],
      "subject": [
        "English as a medium instruction",
        "language competence",
        "unsupportive materials"
      ],
      "description": [
        "Lembar Pengesahan tidak disertai tanda tangan dosen pembimbing",
        "Using English as a medium instruction (EMI) in teaching mathematics and science in Indonesia is a contested issue. While some educationists argue that it is necessary to use English in teaching other subjects in the era of globalization, others argue that this is problematic because of students‟ and teachers‟ lack of English competence, unsupported classroom, and lack of teaching materials (Haagen and Mathelitsch, 2001). This study tries to find out what teachers‟ perception toward the use of English as a medium instruction. The participants consisted of six mathematics teachers and four science teachers from some private elementary schools in Salatiga and Semarang. The teachers teach mathematics and science using English as the medium of instruction in the classroom. The data was collected from semi-structured interview, in which all of the participants were individually interviewed about their perceptions towards EMI. This study found that six teachers did not prefer to EMI. They state that EMI makes the teaching learning process slower due to students‟ lack of English competence. Unsupportive teaching materials also hampered teacher to deliver the material. This finding suggests that EMI should be managed and well-prepared to improve the quality of teaching process. However, by providing seminar and training about EMI, it can be an alternative to improve teachers‟ English competence."
      ],
      "date": [
        "2013-04-15T06:44:20Z",
        "2013-04-15T06:44:20Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "12070885",
        "112007175",
        "http://repository.uksw.edu/handle/123456789/1935"
      ],
      "language": "en",
      "format": "application/pdf",
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/3407",
    "datestamp": "2014-01-28T06:27:16Z",
    "metadata": {
      "title": "An Analysis Of Swearing Word Translations In The Transformers 3 Movie",
      "creator": "Doddy Kurniawan, Yustian",
      "contributor": [
        "Christina Eko Setyarini, Maria",
        "Rudianto, Christian"
      ],
      "subject": [
        "Translation",
        "swearing word",
        "translation procedure"
      ],
      "description": "This study discussed about the analysis of the translation of swearing word in the Transformers 3 Dark of the Moon movie from English to Indonesia. This study was aimed to answer these research questions, “What are the swearing words found in the English to Indonesian subtitle of the Transformers 3 Dark of the Moon movie?” The second one is “What are the types of translation procedures that translator used to translate swearing word in Transformers 3 Dark of the Moon movie?” In attempting to answer the research questions, the study used qualitative method. The research data were obtained from the English to Indonesian subtitle of the Transformers 3 Dark of the Moon movie. The result of the study revealed that there are 53 swearing words that were found in the movie. The study also revealed from 15 types of translation procedure proposed by Newmark (Newmark in Ordudari, 2007) there are only 7 types of translation procedure that were used by translator in translating the swearing words found in the movie. This finding is also supported by the idea from Jensen (2009).",
      "date": [
        "2014-01-28T06:24:17Z",
        "2014-01-28T06:24:17Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112008006",
        "13070771",
        "http://repository.uksw.edu/handle/123456789/3407"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7330",
    "datestamp": "2016-06-09T09:02:47Z",
    "metadata": {
      "title": "Study of Grammatical Errors Madeby Eight Gradersof SMP 2 Ambarawa in Writing Recount",
      "creator": "Febrianty, Resty",
      "contributor": [
        "Murtisari, Elisabet Titik",
        "Listyani"
      ],
      "subject": [
        "error analysis",
        "grammatical error",
        "linguistic taxonomy"
      ],
      "description": "This study aims to investigate the types of grammatical errors found in eight graders in recount writing. The data were collected from 20 students' essays of their holiday experience. In analyzing the data, I used steps suggested by Corder (1974) applied by Ellis and Barkhuizen (2005). With this method, a native speaker teacher helps identify the grammatical errors in the students' work and these errors are later classiied based on Politzer and Ramirez's Linguistic Taxonomy (1973). Finally, based on the identification of errors, each category of errors was counted to find each proportion and explained and discussed.",
      "date": [
        "2016-06-09T09:01:59Z",
        "2016-06-09T09:01:59Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112011704",
        "13090250",
        "http://repository.uksw.edu/handle/123456789/7330"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/5399",
    "datestamp": "2015-03-10T06:32:55Z",
    "metadata": {
      "title": "The Use of Oral Corrective Feedback In Teaching Pronunciation",
      "creator": "Padmini, Kristiana Hesti",
      "contributor": [
        "Setyorini, Maria Christina Eko",
        "Rudianto, Chritian"
      ],
      "subject": [
        "Oral corrective feedback",
        "pronunciation",
        "the use"
      ],
      "description": "This study aimed to find out the types of oral corrective feedback that teachers used in teaching pronunciation. It was a qualitative research which used descriptive way in analyzing the data. The participants were three teachers who teach English in SMK Dian Kirana Sragen, Central Java, Indonesia. The data were obtained through observation to the teachers in their classroom activities. Each participant was observed in his teaching and learning process. The finding revealed that all teachers used Recast, Explicit correction, Repetition, Elicitation and Metalinguistics clue. On the other hand, there were no teacher used Clarification Request in their teaching learning process. This study hopefully could be useful for English teachers, especially who were teaching pronunciation. Hopefully they could give oral corrective feedback to every student‟s mispronunciation. Thus, the students would get the advantages and would be more productive in learning English.",
      "date": [
        "2015-03-10T06:32:02Z",
        "2015-03-10T06:32:02Z",
        "2014"
      ],
      "type": "Thesis",
      "identifier": [
        "112006065",
        "14111813",
        "http://repository.uksw.edu/handle/123456789/5399"
      ],
      "language": "id",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/11075",
    "datestamp": "2017-05-02T06:56:29Z",
    "metadata": {
      "title": "The Variation of Hand Signal Used in the Deaf Community in Salatiga",
      "creator": "Sofyani, Dita Asmara",
      "contributor": "Kendenan, Esriaty Sega",
      "description": "The Variation of Hand Signal Used in the Deaf Community in Salatiga Language can be learned because there is verbal linguistic input. But this process does not occur in deaf people. This causes them to become mute. So they use hand signals to communicate with others. But different hand signals can convey different meanings. It depends on the location, movement and shape. The same shape of some hand signals with different location or movement can convey different meaning. This make hand signal has several variations. This research aims to identify the hand signal variations in the deaf community in Salatiga, to find out  the factors which  influence their  hand signal usage and to describe the impact of the variatons within the deaf community.To find out the variations, the words of Swadesh are used. 40 out of 100 words are chosen. This research observed 15 respondents to find out the hand signal variations, and interviewed them to identify the social background that might have influenced the variations. The social background includes: social class including family background and education, gender and age are identified. From the data identified there are some variations in hand signal usage. From some words the variations could happen until five variations, but there are some words which have no variations. Beside different location, movement and shape influence the variations, different social background also influence the variations. For an examples different education background influenced t he acquisition of hand signal because each school has different way to teach deaf children.This variation could make missunderstanding among deaf people. But they overcome this problem with learn hand signal together in deaf community. If they don’t know the meaning of a sign, they ask and apply it in communication.",
      "date": [
        "2017-05-02T06:56:29Z",
        "2017-05-02T06:56:29Z",
        "2015"
      ],
      "type": "Thesis",
      "identifier": [
        "392014514",
        "16021428",
        "http://repository.uksw.edu/handle/123456789/11075"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf",
        "application/pdf",
        "application/pdf",
        "application/pdf",
        "application/pdf",
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Sastra Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/1920",
    "datestamp": "2013-04-15T02:09:44Z",
    "metadata": {
      "title": "Thanking Strategies Used by English Department Students of Satya Wacana Christian University Students: a Sociolinguistic Study",
      "creator": "Lungindo, Hanafie",
      "subject": [
        "thanking",
        "social factors",
        "strategy"
      ],
      "description": [
        "Lembar Pengesahan tidak disertai tanda tangan dosen pembimbing",
        "This thesis focus is on social factors that influence what someone says or expresses his or her gratitude. From these factors, I am interested to know what types of thanking strategies which Satya Wacana Christian University students as the speakers choose to express the thanking strategies when they receive the act of kindness such as; receiving a favor, getting a compliment and getting a suggestion from others. The data of this study are taken from the questionnaire distributed to sixty respondents which consist of twenty students from 2nd semester, twenty students from 4th semester, and twenty students from6th semester students of the English Department Faculty in Satya Wacana ChristianUniversity. The data are analyzed based on the strategies of thanking proposed by Haverkate (1984). From the data analysis, I find out that strategy A which is thanking somebody explicitly is the mostly used strategy by the students. The other two strategies mostly used by the students are strategy G which is expressing emotion and strategy D which is expressing appreciation of the act. I also recognize both of male and female rarely use strategy E which is acknowledging a debt of gratitude and strategy B which is expressing gratitude."
      ],
      "date": [
        "2013-04-15T02:05:59Z",
        "2013-04-15T02:05:59Z",
        "2012"
      ],
      "type": "Thesis",
      "identifier": [
        "12030232",
        "112006112",
        "http://repository.uksw.edu/handle/123456789/1920"
      ],
      "language": "en",
      "format": "application/pdf",
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  },
  {
    "identifier": "oai:repository.uksw.edu:123456789/7293",
    "datestamp": "2016-06-08T02:11:50Z",
    "metadata": {
      "title": "Problems Encountered by Teachers in Applying Communicative Language Teaching in EFL Classroom: a Study at SMP N 2 Pringapus",
      "creator": "Apriliandaru, Elfira Widiarti",
      "contributor": [
        "Astika, Gusti",
        "Ragawanti, Debora Tri"
      ],
      "subject": [
        "communicative language teaching (CLT)",
        "communicative competence",
        "english as foreign language (EFL)"
      ],
      "description": "The existing role of English as a lingua franca makes EFL countries think that it is necessary to make changes to their English curriculum to engage more communicative approach to language teaching. Get along with that, many experts have proposed Communicative Language Teaching as the most effective approach to gain the learners' communicative competence. However, some countries in Asia have been unsuccessful in introducing Communicative Language Teaching (CLT) in their English classes (Carless, 2003, as cited in Dailey, 2010). Regarding with that statement, this study investigated an overview of the CLT implementation at SMP N 2 Pringapus. In this study, it is tended to investigate whether the SMP N 2 Pringapus English teachers are at ease when using CLT in their classes or not. That is, whether the teachers are capable of making use of CLT in their classes to achieve its main goal, that is communication in real context. Besides, this paper also will focus to determine the problems that might occur during the CLT implementation. So, three English teachers of SMP N 2 Pringapus were asked to conduct three times teaching trials to apply CLT in their classes. The teaching trials would be observed to see the probable diiculties they might encounter when using CLT. In addition to the teaching trials, each teacher was interviewed for about 25 minutes so they might share their experiences in using CLT in their teaching trials and also express their ideas and reflection of applying CLT in their genuine classes.",
      "date": [
        "2016-06-08T02:11:22Z",
        "2016-06-08T02:11:22Z",
        "2013"
      ],
      "type": "Thesis",
      "identifier": [
        "112009063",
        "13070786",
        "http://repository.uksw.edu/handle/123456789/7293"
      ],
      "language": "en",
      "format": [
        "application/pdf",
        "application/pdf"
      ],
      "publisher": "Program Studi Pendidikan Bahasa Inggris FBS-UKSW"
    }
  }
]
